[{"id":1,"name":"Spain","capital":"Madrid","description":"Spain, country located in extreme southwestern Europe. It occupies about 85 percent of the Iberian Peninsula, which it shares with its smaller neighbour Portugal.\r\n\r\nA village in Andalusia, Spain, showing housing typical of the region.\r\nSpain is a storied country of stone castles, snowcapped mountains, vast monuments, and sophisticated cities, all of which have made it a favoured travel destination. The country is geographically and culturally diverse. Its heartland is the Meseta, a broad central plateau half a mile above sea level. Much of the region is traditionally given over to cattle ranching and grain production; it was in this rural setting that Miguel de Cervantes’s Don Quixote tilted at the tall windmills that still dot the landscape in several places. In the country’s northeast are the broad valley of the Ebro River, the mountainous region of Catalonia, and the hilly coastal plain of Valencia. To the northwest is the Cantabrian Mountains, a rugged range in which heavily forested, rain-swept valleys are interspersed with tall peaks. To the south is the citrus-orchard-rich and irrigated lands of the valley of the Guadalquivir River, celebrated in the renowned lyrics of Spanish poets Federico García Lorca and Antonio Machado; over this valley rises the snowcapped Sierra Nevada. The southern portion of the country is desert, an extension of the Sahara made familiar to Americans through the “spaghetti western” films of the 1960s and early ’70s. Lined with palm trees, rosemary bushes, and other tropical vegetation, the southeastern Mediterranean coast and the Balearic Islands enjoy a gentle climate, drawing millions of visitors and retirees, especially from northern Europe.\r\n\r\nTorre Agbar skyscraper at night in Barcelona.\r\nSpain’s countryside is quaint, speckled with castles, aqueducts, and ancient ruins, but its cities are resoundingly modern. The Andalusian capital of Sevilla (Seville) is famed for its musical culture and traditional folkways; the Catalonian capital of Barcelona for its secular architecture and maritime industry; and the national capital of Madrid for its winding streets, its museums and bookstores, and its around-the-clock lifestyle. Madrid is Spain’s largest city and is also its financial and cultural centre, as it has been for hundreds of years.\r\n\r\nThe many and varied cultures that have gone into the making of Spain—those of the Castilians, Catalonians, Lusitanians, Galicians, Basques, Romans, Arabs, Jews, and Roma (Gypsies), among other peoples—are renowned for their varied cuisines, customs, and prolific contributions to the world’s artistic heritage. The country’s Roman conquerors left their language, roads, and monuments, while many of the Roman Empire’s greatest rulers were Spanish, among them Trajan, Hadrian, and Marcus Aurelius. The Moors, who ruled over portions of Spain for nearly 800 years, left a legacy of fine architecture, lyric poetry, and science; the Roma contributed the haunting music called the cante jondo (a form of flamenco), which, wrote García Lorca, “comes from remote races and crosses the graveyard of the years and the fronds of parched winds. It comes from the first sob and the first kiss.” Even the Vandals, Huns, and Visigoths who swept across Spain following the fall of Rome are remembered in words and monuments, which prompted García Lorca to remark, “In Spain, the dead are more alive than the dead of any other country in the world.”\r\n\r\nIllustration depicting Christopher Columbus's fleet departing from Spain in 1492.\r\nIn 1492, the year the last of the Moorish rulers were expelled from Spain, ships under the command of Christopher Columbus reached America. For 300 years afterward, Spanish explorers and conquerors traveled the world, claiming huge territories for the Spanish crown, a succession of Castilian, Aragonese, Habsburg, and Bourbon rulers. For generations Spain was arguably the richest country in the world, and certainly the most far-flung. With the steady erosion of its continental and overseas empire throughout the 18th and 19th centuries, however, Spain was all but forgotten in world affairs, save for the three years that the ideologically charged Spanish Civil War (1936–39) put the country at the centre of the world’s stage, only to become ever more insular and withdrawn during the four decades of rule by dictator Francisco Franco. Following Franco’s death in 1975, a Bourbon king, Juan Carlos, returned to the throne and established a constitutional monarchy. The country has been ruled since then by a succession of elected governments, some socialist, some conservative, but all devoted to democracy.","continent":"Europe","climate_zone":"CSA = Hot-summer Mediterranean climate; coldest month averaging above 0 °C (32 °F) and at least one month’s average temperature above 22 °C (71.6 °F) and at least four months averaging above 10 °C (50 °F). At least three times as much precipitation in the wettest month of winter as in the driest month of summer, and driest month of summer receives less than 30 mm (1.2 in).","language":"Spanish","safety_index":1.649000000000000021,"safety_and_security":"","broadband_speed":168.6299999999999955,"internet_accessibility":"","cost_of_living":2329,"avg_rent_cost":1093,"healthcare_index":77.59999999999999431,"cultural_and_recreational_opportunities":"","flag_url":"https://upload.wikimedia.org/wikipedia/commons/thumb/9/9a/Flag_of_Spain.svg/100px-Flag_of_Spain.svg.png","image":"","mobile_speed":35.10000000000000142},
{"id":2,"name":"Portugal","capital":"Lisbon","description":"Portugal, country lying along the Atlantic coast of the Iberian Peninsula in southwestern Europe. Once continental Europe’s greatest power, Portugal shares commonalities—geographic and cultural—with the countries of both northern Europe and the Mediterranean. Its cold, rocky northern coast and mountainous interior are sparsely settled, scenic, and wild, while the country’s south, the Algarve, is warm and fertile. The rugged Estrela Mountains (Serra da Estrela, or “Star Mountain Range”), which lie between the Tagus and Mondego rivers, contain the highest point of mainland Portugal.\r\n\r\nIn the 1st millennium BCE the Celtic Lusitani entered the Iberian Peninsula and settled the land, and many traces of their influence remain. According to national legend, though, Lisbon, the national capital, was founded not by Celts but by the ancient Greek warrior Odysseus, who was said to have arrived at a rocky headland near what is the present-day city after leaving his homeland to wander the world and who, liking what he saw, stayed there for a while; his departure was said to have broken the heart of the nymph Calypso, who, the legend goes, turned herself into a snake, her coils becoming the seven hills of Lisbon. Of course, had Odysseus actually come to Portugal, he would have found the land already well settled by the Lusitani.\r\n\r\nLusitani tribes battled the Romans for generations before acceding to empire, whereupon Rome established several important towns and ports; the Roman presence can be seen in the very name of the country, which derives from Portus Cale, a settlement near the mouth of the Douro River and the present-day city of Porto. Later, the descendants of Romans and the Lusitani would live under Moorish rule for several centuries until an independent kingdom was established.\r\n\r\nIn constant battle and rivalry with Spain, its eastern neighbour, Portugal then turned to the sea and, after Henry the Navigator’s establishment of a school of navigation at Sagres, in time founded a vast overseas empire that would become Europe’s largest and richest. Much of that empire was quickly lost, but even then Portugal retained sizable holdings along the African coast, in southern and eastern Asia, and in South America. Portugal remained a colonial power until the mid-1970s, when a peaceful revolution transformed the country from a dictatorship into a democratic republic. Long among the poorest countries of Europe, Portugal modernized in the last decades of the 20th century, expanding its economy from one based primarily on textile manufacture and livestock raising to include a range of manufactures and services.\r\n\r\nLisbon is Portugal’s capital and economic and cultural centre. The city clings to low but steep hills situated on the right bank of the Tagus and is a popular tourist destination. Lisbon is rather more tranquil and reserved than Madrid in neighbouring Spain, but it shares with it a reputation for great food, melancholy and romantic music, dance, and sport. Portuguese traditionally have prized a simple and unostentatious life, favouring the rural over the urban and the traditional to the modern, where a fine meal might consist of carne de porco à Alentejana (lean pork stuffed with clams), thick-crusted bread, and dark wine. Portuguese delight in the countryside, where they gather to hold family picnics, tend to their gardens and orchards, and relax. It is from the countryside that the fado, a form of romantic ballad, is thought to have come (though it is now clearly associated with the cities of Lisbon and Coimbra), and it is in the countryside that the country’s traditional sport of bullfighting takes its finest form, though in Portuguese bullfighting the bull is not killed but rather is retired to the countryside for the rest of its life.\r\n\r\nLisbon was designated a European City of Culture in 1994, and in 1998 it hosted the World’s Fair (Expo ’98). Both events raised Portugal’s profile worldwide. The latter event sparked the city’s biggest renewal project since the rebuilding that followed the 1755 earthquake, including the construction of the six-lane Vasco da Gama Bridge over the Tagus River estuary, then the longest bridge in Europe.","continent":"Europe","climate_zone":"CSA = Hot-summer Mediterranean climate; coldest month averaging above 0 °C (32 °F) and at least one month’s average temperature above 22 °C (71.6 °F) and at least four months averaging above 10 °C (50 °F). At least three times as much precipitation in the wettest month of winter as in the driest month of summer, and driest month of summer receives less than 30 mm (1.2 in).","language":"Portugese","safety_index":1.332999999999999963,"safety_and_security":"","broadband_speed":120.5199999999999961,"internet_accessibility":"","cost_of_living":2366,"avg_rent_cost":1133,"healthcare_index":72.70000000000000284,"cultural_and_recreational_opportunities":"","flag_url":"https://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/Flag_of_Portugal.svg/100px-Flag_of_Portugal.svg.png","image":"","mobile_speed":59.22999999999999688},
{"id":3,"name":"Italy","capital":"Rome","description":"Italy, country of south-central Europe, occupying a peninsula that juts deep into the Mediterranean Sea. Italy comprises some of the most varied and scenic landscapes on Earth and is often described as a country shaped like a boot. At its broad top stand the Alps, which are among the world’s most rugged mountains. Italy’s highest points are along Monte Rosa, which peaks in Switzerland, and along Mont Blanc, which peaks in France. The western Alps overlook a landscape of Alpine lakes and glacier-carved valleys that stretch down to the Po River and the Piedmont. Tuscany, to the south of the cisalpine region, is perhaps the country’s best-known region. From the central Alps, running down the length of the country, radiates the tall Apennine Range, which widens near Rome to cover nearly the entire width of the Italian peninsula. South of Rome the Apennines narrow and are flanked by two wide coastal plains, one facing the Tyrrhenian Sea and the other the Adriatic Sea. Much of the lower Apennine chain is near-wilderness, hosting a wide range of species rarely seen elsewhere in western Europe, such as wild boars, wolves, asps, and bears. The southern Apennines are also tectonically unstable, with several active volcanoes, including Vesuvius, which from time to time belches ash and steam into the air above Naples and its island-strewn bay. At the bottom of the country, in the Mediterranean Sea, lie the islands of Sicily and Sardinia.\r\n\r\nItaly’s political geography has been conditioned by this rugged landscape. With few direct roads between them, and with passage from one point to another traditionally difficult, Italy’s towns and cities have a history of self-sufficiency, independence, and mutual mistrust. Visitors today remark on how unlike one town is from the next, on the marked differences in cuisine and dialect, and on the many subtle divergences that make Italy seem less a single nation than a collection of culturally related points in an uncommonly pleasing setting.\r\n\r\nAcross a span of more than 3,000 years, Italian history has been marked by episodes of temporary unification and long separation, of intercommunal strife and failed empires. At peace for more than half a century now, Italy’s inhabitants enjoy a high standard of living and a highly developed culture.","continent":"Europe","climate_zone":"CSA = Hot-summer Mediterranean climate; coldest month averaging above 0 °C (32 °F) and at least one month’s average temperature above 22 °C (71.6 °F) and at least four months averaging above 10 °C (50 °F). At least three times as much precipitation in the wettest month of winter as in the driest month of summer, and driest month of summer receives less than 30 mm (1.2 in).","language":"Italian","safety_index":1.661999999999999922,"safety_and_security":"","broadband_speed":60.38000000000000255,"internet_accessibility":"","cost_of_living":2929,"avg_rent_cost":1328,"healthcare_index":65.59999999999999431,"cultural_and_recreational_opportunities":"","flag_url":"https://upload.wikimedia.org/wikipedia/commons/thumb/0/03/Flag_of_Italy.svg/100px-Flag_of_Italy.svg.png","image":"","mobile_speed":42.67999999999999972},
{"id":6,"name":"Greece","capital":"Athens","description":"Greece, the southernmost of the countries of the Balkan Peninsula. Geography has greatly influenced the country’s development. Mountains historically restricted internal communications, but the sea opened up wider horizons. The total land area of Greece (one-fifth of which is made up of the Greek islands) is comparable in size to England or the U.S. state of Alabama.\r\n\r\nExploring Athens: A fusion of history and modernity\r\nExploring Athens: A fusion of history and modernity\r\nOverview of Athens.See all videos for this article\r\nGreece has more than 2,000 islands, of which about 170 are inhabited; some of the easternmost Aegean islands lie just a few miles off the Turkish coast. The country’s capital is Athens, which expanded rapidly in the second half of the 20th century. Attikí (ancient Greek: Attica), the area around the capital, is now home to about one-third of the country’s entire population.\r\n\r\nA Greek legend has it that God distributed soil through a sieve and used the stones that remained to build Greece. The country’s barren landscape historically caused the people to migrate. The Greeks, like the Jews and the Armenians, traditionally have been a people of diaspora, and several million people of Greek descent live in various parts of the world. Xeniteia, or sojourning in foreign lands, with its strong overtones of nostalgia for the faraway homeland, has been a central element in the historical experience of the Greek people.","continent":"Europe","climate_zone":"CSA = Hot-summer Mediterranean climate; coldest month averaging above 0 °C (32 °F) and at least one month’s average temperature above 22 °C (71.6 °F) and at least four months averaging above 10 °C (50 °F). At least three times as much precipitation in the wettest month of winter as in the driest month of summer, and driest month of summer receives less than 30 mm (1.2 in).","language":"Greek","safety_index":1.889999999999999903,"safety_and_security":"","broadband_speed":43.38000000000000255,"internet_accessibility":"","cost_of_living":1843,"avg_rent_cost":716,"healthcare_index":57.29999999999999716,"cultural_and_recreational_opportunities":"","flag_url":"https://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/Flag_of_Greece.svg/100px-Flag_of_Greece.svg.png","image":"","mobile_speed":61.6700000000000017},
{"id":8,"name":"Malta","capital":"Valletta","description":"Malta, island country located in the central Mediterranean Sea. A small but strategically important group of islands, the archipelago has through its long and turbulent history played a vital role in the struggles of a succession of powers for domination of the Mediterranean and in the interplay between emerging Europe and the older cultures of Africa and the Middle East. As a result, Maltese society has been molded by centuries of foreign rule by various powers, including the Phoenicians, Romans, Greeks, Arabs, Normans, Sicilians, Swabians, Aragonese, Hospitallers, French, and British.\r\n\r\nThe island of Malta specifically played a vital strategic role in World War II as a base for the Allied Powers. It was heavily bombarded by German and Italian aircraft, and by the end of the war Malta was devastated. In 1942 the island of Malta was presented with the George Cross, a British award for great gallantry, in recognition of the wartime bravery of the Maltese people. After the war, the movement for self-governance became stronger. The country of Malta became independent from Britain and joined the Commonwealth in 1964 and was declared a republic on December 13, 1974. It was admitted to the European Union (EU) in 2004. A European atmosphere predominates in Malta as a result of close association with the Continent, particularly with southern Europe. The Maltese are renowned for their warmth, hospitality, and generosity to strangers, a trait that was noted in the Acts of the Apostles, with respect to the experience of St. Paul, the Apostle, who was said to have been shipwrecked off Malta in 60 CE.\r\n\r\nRoman Catholicism is a major influence on Maltese culture. Various traditions have evolved around religious celebrations, notably those honouring the patron saints of towns and villages. The eight-pointed, or Maltese, cross, adopted by the Hospitallers of St. John of Jerusalem in 1126, is commonly linked with Malta’s identity and is printed on the country’s euro coin. Valletta is the capital city.","continent":"Europe","climate_zone":"CSA = Hot-summer Mediterranean climate; coldest month averaging above 0 °C (32 °F) and at least one month’s average temperature above 22 °C (71.6 °F) and at least four months averaging above 10 °C (50 °F). At least three times as much precipitation in the wettest month of winter as in the driest month of summer, and driest month of summer receives less than 30 mm (1.2 in).","language":"Maltese, English","safety_index":null,"safety_and_security":"","broadband_speed":94.4599999999999938,"internet_accessibility":"","cost_of_living":3057,"avg_rent_cost":1430,"healthcare_index":52.29999999999999716,"cultural_and_recreational_opportunities":"","flag_url":"https://upload.wikimedia.org/wikipedia/commons/thumb/7/73/Flag_of_Malta.svg/100px-Flag_of_Malta.svg.png","image":"","mobile_speed":47.96000000000000085},
{"id":9,"name":"Norway","capital":"Oslo","description":"Norway, country of northern Europe that occupies the western half of the Scandinavian peninsula. Nearly half of the inhabitants of the country live in the far south, in the region around Oslo, the capital. About two-thirds of Norway is mountainous, and off its much-indented coastline lie, carved by deep glacial fjords, some 50,000 islands.\r\n\r\nIndo-European peoples settled Norway’s coast in antiquity, establishing a permanent settlement near the present capital of Oslo some 6,000 years ago. The interior was more sparsely settled, owing to extremes of climate and difficult terrain, and even today the country’s population is concentrated in coastal cities such as Bergen and Trondheim. Dependent on fishing and farming, early Norwegians developed a seafaring tradition that would reach its apex in the Viking era, when Norse warriors regularly raided the British Isles, the coasts of western Europe, and even the interior of Russia; the Vikings also established colonies in Iceland and Greenland and explored the coast of North America (which Leif Eriksson called Vinland) more than a thousand years ago. This great tradition of exploration by such explorers as Leif Erikkson and his father, Erik the Red, continued into modern times, exemplified by such men as Fridtjof Nansen, Roald Amundsen, and Thor Heyerdahl. Weakened by plague and economic deterioration in the late Middle Ages and dominated by neighbouring Denmark and Sweden, Norwegians turned to trading in fish and lumber, and modern Norway, which gained its independence in 1905, emerged as a major maritime transporter of the world’s goods as well as a world leader in specialized shipbuilding. In the 1970s the exploitation of offshore oil and natural gas became the major maritime industry, with Norway emerging in the 1990s as one of the world’s leading petroleum exporters.\r\n\r\nLying on the northern outskirts of the European continent and thus avoiding the characteristics of a geographic crossroads, Norway (the “northern way”) has maintained a great homogeneity among its peoples and their way of life. Small enclaves of immigrants, mostly from southeastern Europe and South Asia, established themselves in the Oslo region in the late 20th century, but the overwhelming majority of the country’s inhabitants are ethnically Nordic. The northern part of the country, particularly the rugged Finnmark Plateau, is home to the Sami (also called Lapps or Laplanders), a Uralic people whose origins are obscure. Life expectancy rates in Norway are among the highest in the world. The main political division reflects differing views on the importance of free-market forces; but the socialists long ago stopped insisting on nationalization of the country’s industry, and the nonsocialists have accepted extensive governmental control of the country’s economy. Such evident national consensus—along with abundant waterpower, offshore oil, and peaceful labour relations—was a major factor in the rapid growth of Norway as an industrial nation during the 20th century and in the creation of one of the highest standards of living in the world, reinforced by a comprehensive social welfare system.\r\n\r\nNorway’s austere natural beauty has attracted visitors from all over the world. The country has also produced many important artists, among them composer Edvard Grieg, painter Edvard Munch, novelists Knut Hamsun and Sigrid Undset, and playwright Henrik Ibsen. Of his country and its ruminative people, Ibsen observed, “The magnificent, but severe, natural environment surrounding people up there in the north, the lonely, secluded life—the farms are miles apart—forces them to…become introspective and serious.…At home every other person is a philosopher!”","continent":"Europe","climate_zone":"DFC = Subarctic climate; coldest month averaging below 0 °C (32 °F) and 1–3 months averaging above 10 °C (50 °F). No significant precipitation difference between seasons (neither abovementioned set of conditions fulfilled).","language":"Norwegian","safety_index":1.550000000000000044,"safety_and_security":"","broadband_speed":109.4200000000000017,"internet_accessibility":"","cost_of_living":3353,"avg_rent_cost":1509,"healthcare_index":75.70000000000000284,"cultural_and_recreational_opportunities":"","flag_url":"https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Flag_of_Norway.svg/100px-Flag_of_Norway.svg.png","image":"","mobile_speed":128.1399999999999863},
{"id":11,"name":"Iceland","capital":"Reykjavík","description":"Iceland, island country located in the North Atlantic Ocean. Lying on the constantly active geologic border between North America and Europe, Iceland is a land of vivid contrasts of climate, geography, and culture. Sparkling glaciers, such as Vatna Glacier (Vatnajökull), Europe’s largest, lie across its ruggedly beautiful mountain ranges; abundant hot geysers provide heat for many of the country’s homes and buildings and allow for hothouse agriculture year-round; and the offshore Gulf Stream provides a surprisingly mild climate for what is one of the northernmost inhabited places on the planet.\r\n\r\nIceland was founded more than 1,000 years ago during the Viking age of exploration and settled by a mixed Norse and Celtic population. The early settlement, made up primarily of Norwegian seafarers and adventurers, fostered further excursions to Greenland and the coast of North America (which the Norse called Vinland). Despite its physical isolation some 500 miles (800 km) from Scotland—its nearest European neighbour—Iceland has remained throughout its history very much a part of European civilization. The Icelandic sagas, most of which recount heroic episodes that took place at the time the island was settled, are regarded as among the finest literary achievements of the Middle Ages, reflecting a European outlook while commemorating the history and customs of a people far removed from continental centres of commerce and culture.\r\n\r\nThe capital, Reykjavík (“Bay of Smokes”), is the site of the island’s first farmstead and is a thriving city, handsome in aspect and cosmopolitan in outlook. Other major population centres are Akureyri, on the north-central coast; Hafnarfjördhur, on the southwestern coast; and Selfoss, in the southern lowlands.","continent":"Europe","climate_zone":"ET = Mild tundra climate; all 12 months of the year with average temperatures between 0 °C (32 °F) and 10 °C (50 °F).","language":"Icelandic","safety_index":1.124000000000000111,"safety_and_security":"","broadband_speed":null,"internet_accessibility":"","cost_of_living":4267,"avg_rent_cost":1924,"healthcare_index":67.09999999999999431,"cultural_and_recreational_opportunities":"","flag_url":"https://upload.wikimedia.org/wikipedia/commons/thumb/c/ce/Flag_of_Iceland.svg/100px-Flag_of_Iceland.svg.png","image":"","mobile_speed":null},
{"id":12,"name":"Ireland","capital":"Dublin","description":"Ireland, country of western Europe occupying five-sixths of the westernmost major island of the British Isles.\r\n\r\nThe magnificent scenery of Ireland’s Atlantic coastline faces a 2,000-mile- (3,200-km-) wide expanse of ocean, and its geographic isolation has helped it to develop a rich heritage of culture and tradition that was linked initially to the Gaelic language. Washed by abundant rain, the country’s pervasive grasslands create a green-hued landscape that is responsible for the popular sobriquet Emerald Isle. Ireland is also renowned for its wealth of folklore, from tales of tiny leprechauns with hidden pots of gold to that of the patron saint, Patrick, with his legendary ridding the island of snakes and his reputed use of the three-leaved shamrock as a symbol for the Christian Trinity. But while many may think of Ireland as an enchanted land, the republic has been beset with perennial concerns—emigration, cultural and political identity, and relations with Northern Ireland (comprising the 6 of Ireland’s 32 counties within the province of Ulster that remain part of the United Kingdom). At the beginning of the 21st century, Ireland’s long-standing economic problems were abating, owing to its diverse export-driven economy, but calamity struck again in 2008 when a new financial and economic crisis befell the country, culminating in a very costly bailout of the Irish economy by the European Union (EU) and the International Monetary Fund.\r\n\r\nThe emergence of Ireland as an independent country is a fairly recent phenomenon. Until the 17th century, political power was widely shared among a rather loosely constructed network of small earldoms in often-shifting alliances. Following the so-called “Flight of the Earls” after an unsuccessful uprising in the early 17th century, Ireland effectively became an English colony. It was formally incorporated into the United Kingdom in 1801. A 1914 Home Rule Act was passed but never implemented due to pro-union militancy in the north, the onset of World War I, and the subsequent Irish War of Independence. In 1920 the island was effectively partitioned with the creation of Northern Ireland, a six-county area with devolved powers within the United Kingdom, whereas under the Anglo-Irish Treaty of December 6, 1921, the other 26 counties became the Irish Free State, a self-governing dominion within the British Commonwealth and Empire. In 1937 the southern state passed a new constitution that offered a more robust expression of sovereignty, and in 1949 it formally left the Commonwealth as the Republic of Ireland.","continent":"Europe","climate_zone":"CFB = Temperate oceanic climate; coldest month averaging above 0 °C (32 °F), all months with average temperatures below 22 °C (71.6 °F), and at least four months averaging above 10 °C (50 °F). No significant precipitation difference between seasons (neither abovementioned set of conditions fulfilled).","language":"Irish, English","safety_index":1.312000000000000055,"safety_and_security":"","broadband_speed":79.37000000000000454,"internet_accessibility":"","cost_of_living":4483,"avg_rent_cost":2197,"healthcare_index":51.79999999999999716,"cultural_and_recreational_opportunities":"","flag_url":"https://upload.wikimedia.org/wikipedia/commons/thumb/4/45/Flag_of_Ireland.svg/100px-Flag_of_Ireland.svg.png","image":"","mobile_speed":26.53999999999999915},
{"id":13,"name":"Romania","capital":"Bucharest","description":"Romania, country of southeastern Europe. The national capital is Bucharest. Romania was occupied by Soviet troops in 1944 and became a satellite of the Union of Soviet Socialist Republics (U.S.S.R.) in 1948. The country was under communist rule from 1948 until 1989, when the regime of Romanian leader Nicolae Ceaușescu was overthrown. Free elections were held in 1990. In 2004 the country joined the North Atlantic Treaty Organization (NATO), and in 2007 it became a member of the European Union (EU).\r\n\r\nThe Romanian landscape is approximately one-third mountainous and one-third forested, with the remainder made up of hills and plains. The climate is temperate and marked by four distinct seasons. Romania enjoys a considerable wealth of natural resources: fertile land for agriculture; pastures for livestock; forests that provide hard and soft woods; petroleum reserves; metals, including gold and silver in the Apuseni Mountains; numerous rivers that supply hydroelectricity; and a Black Sea coastline that is the site of both ports and resorts.\r\n\r\nThe Romanian people derive much of their ethnic and cultural character from Roman influence, but this ancient identity has been reshaped continuously by Romania’s position astride major continental migration routes. Romanians regard themselves as the descendants of the ancient Romans who conquered southern Transylvania under the emperor Trajan in 105 CE and of the Dacians who lived in the mountains north of the Danubian Plain and in the Transylvanian Basin. By the time of the Roman withdrawal under the emperor Aurelian in 271, the Roman settlers and the Dacians had intermarried, resulting in a new nation. Both the Latin roots of the Romanian language and the Eastern Orthodox faith to which most Romanians adhere emerged from the mixture of these two cultures.\r\n\r\nFrom the arrival of the Huns in the 5th century until the emergence of the principalities of Walachia and Moldavia in the 14th century, the Romanian people virtually disappeared from written history. During this time Romania was invaded by great folk migrations and warriors on horseback who traveled across the Danubian Plain. It is believed that in the face of ceaseless violence the Romanians were forced to relocate, finding safety in the Carpathian Mountains. As military chief Helmuth von Moltke observed: “Resistance having nearly always proven useless, the Romanians could no longer think of any other way of defense than flight.”\r\n\r\nFor the next 600 years the Romanian lands served as battlegrounds for their neighbours’ conflicting ambitions. The Romanians were unable to withstand the imperial pressures first from the Byzantines and then from the Ottoman Turks to the south in Constantinople (now Istanbul), or later from the Habsburg empire to the west and from Russia to the east.\r\n\r\nIn 1859 the principalities of Walachia and Moldavia were united, and in 1877 they proclaimed their independence from the Ottoman Empire as the modern Romania. This was accompanied by a conversion from the Cyrillic alphabet to the Latin and by an exodus of students who sought higher education in western Europe, especially France.\r\n\r\nDespite its late start as a European nation-state, Romania in the 20th century produced several world-renowned intellectuals, including composer Georges Enesco, playwright Eugène Ionesco, philosopher Emil Cioran, religion historian Mircea Eliade, and Nobel laureate George E. Palade. On the eve of World War II, journalist Rosa Goldschmidt Waldeck (Countess Waldeck) described her strongest impression of the Romanians:\r\n\r\nTwo thousand years of severe foreign masters, barbarian invasions, rapacious conquers, wicked princes, cholera, and earthquakes have given Rumanians a superb sense of the temporary and transitory quality of everything. Experience in survival has taught them that each fall may result in unforeseen opportunities and that somehow they always get on their feet again.","continent":"Europe","climate_zone":"DFB = Warm-summer humid continental climate; coldest month averaging below 0 °C (32 °F), all months with average temperatures below 22 °C (71.6 °F), and at least four months averaging above 10 °C (50 °F). No significant precipitation difference between seasons (neither abovementioned set of conditions fulfilled).","language":"Romanian","safety_index":1.649000000000000021,"safety_and_security":"","broadband_speed":160.6500000000000056,"internet_accessibility":"","cost_of_living":1409,"avg_rent_cost":578,"healthcare_index":56.29999999999999716,"cultural_and_recreational_opportunities":"","flag_url":"https://upload.wikimedia.org/wikipedia/commons/thumb/7/73/Flag_of_Romania.svg/100px-Flag_of_Romania.svg.png","image":"","mobile_speed":42.6700000000000017},
{"id":14,"name":"Netherlands","capital":"Amsterdam","description":"Netherlands, country located in northwestern Europe, also known as Holland. “Netherlands” means low-lying country; the name Holland (from Houtland, or “Wooded Land”) was originally given to one of the medieval cores of what later became the modern state and is still used for 2 of its 12 provinces (Noord-Holland and Zuid-Holland). A parliamentary democracy under a constitutional monarch, the kingdom includes its former colonies in the Lesser Antilles: Aruba, Bonaire, Curaçao, Saba, Sint Eustatius, and Sint Maarten. The capital is Amsterdam and the seat of government The Hague.\r\n\r\nThe country is indeed low-lying and remarkably flat, with large expanses of lakes, rivers, and canals. Some 2,500 square miles (6,500 square km) of the Netherlands consist of reclaimed land, the result of a process of careful water management dating back to medieval times. Along the coasts, land was reclaimed from the sea, and, in the interior, lakes and marshes were drained, especially alongside the many rivers. All this new land was turned into polders, usually surrounded by dikes. Initially, man power and horsepower were used to drain the land, but they were later replaced by windmills, such as the mill network at Kinderdijk-Elshout, now a UNESCO World Heritage site. The largest water-control schemes were carried out in the second half of the 19th century and in the 20th century, when steam pumps and, later, electric or diesel pumps came into use.\r\n\r\nDespite government-encouraged emigration after World War II, which prompted some 500,000 persons to leave the country, the Netherlands is today one of the world’s most densely populated countries. Although the population as a whole is “graying” rapidly, with a high percentage over age 65, Amsterdam has remained one of the liveliest centres of international youth culture. There, perhaps more than anywhere else in the country, the Dutch tradition of social tolerance is readily encountered. Prostitution, “soft-drug” (marijuana and hashish) use, and euthanasia are all legal but carefully regulated in the Netherlands, which was also the first country to legalize same-sex marriage.\r\n\r\nThis relative independence of outlook was evident as early as the 16th and 17th centuries, when the Dutch rejected monarchical controls and took a relatively enlightened view of other cultures, especially when they brought wealth and capital to the country’s trading centres. In that period Dutch merchant ships sailed the world and helped lay the foundations of a great trading country characterized by a vigorous spirit of enterprise. In later centuries, the Netherlands continued to have one of the most advanced economies in the world, despite the country’s modest size. The Dutch economy is open and generally internationalist in outlook. With Belgium and Luxembourg, the Netherlands is a member of the Benelux economic union, which in the 1950s and 1960s served as a model for the larger European Economic Community (EEC; now embedded in the European Union [EU]), of which the Benelux countries are members. The Netherlands is also a member of the North Atlantic Treaty Organization (NATO) and the Organisation for Economic Co-operation and Development (OECD), and it plays host to a number of international organizations, especially in the legal sector, such as the International Court of Justice.\r\n\r\nThe Dutch reputation for tolerance was tested in the late 20th and early 21st centuries, when an increase in immigration from non-European Union countries and a populist turn in politics resulted in growing nationalism and even xenophobia, marked by two race-related political assassinations, in 2002 and 2004, and the government’s requirement that immigrants pass an expensive ‘‘integration’’ test before they enter the country.","continent":"Europe","climate_zone":"CFB = Temperate oceanic climate; coldest month averaging above 0 °C (32 °F), all months with average temperatures below 22 °C (71.6 °F), and at least four months averaging above 10 °C (50 °F). No significant precipitation difference between seasons (neither abovementioned set of conditions fulfilled).","language":"Dutch","safety_index":1.489999999999999992,"safety_and_security":"","broadband_speed":121.5499999999999972,"internet_accessibility":"","cost_of_living":3570,"avg_rent_cost":1701,"healthcare_index":78.90000000000000569,"cultural_and_recreational_opportunities":"","flag_url":"https://upload.wikimedia.org/wikipedia/commons/thumb/2/20/Flag_of_the_Netherlands.svg/100px-Flag_of_the_Netherlands.svg.png","image":"","mobile_speed":112.1500000000000056},
{"id":15,"name":"Hungary","capital":"Budapest","description":"Hungary, landlocked country of central Europe. The capital is Budapest.\r\n\r\nAt the end of World War I, defeated Hungary lost 71 percent of its territory as a result of the Treaty of Trianon (1920). Since then, grappling with the loss of more than two-thirds of their territory and people, Hungarians have looked to a past that was greater than the present as their collective psyche suffered from the so-called “Trianon Syndrome.” The syndrome was widespread prior to 1945; it was suppressed during Soviet domination (1945–90); and it reemerged during independence in 1990, when it took on a different form. The modern country appears to be split into two irreconcilable factions: those who are still concerned about Trianon and those who would like to forget it. This split is evident in most aspects of Hungarian political, social, and cultural life.\r\n\r\nHungarians, who know their country as Magyarország, “Land of Magyars,” are unique among the nations of Europe in that they speak a language that is not related to any other major European language. Linguistically surrounded by alien nations, Hungarians felt isolated through much of their history. This may be the reason why after Christianization they became attached to Latin, which became the language of culture, scholarship, and state administration—and even the language of the Hungarian nobility until 1844.","continent":"Europe","climate_zone":"CFB = Temperate oceanic climate; coldest month averaging above 0 °C (32 °F), all months with average temperatures below 22 °C (71.6 °F), and at least four months averaging above 10 °C (50 °F). No significant precipitation difference between seasons (neither abovementioned set of conditions fulfilled).","language":"Hungarian","safety_index":1.508000000000000007,"safety_and_security":"","broadband_speed":118.7900000000000062,"internet_accessibility":"","cost_of_living":1779,"avg_rent_cost":740,"healthcare_index":54,"cultural_and_recreational_opportunities":"","flag_url":"https://upload.wikimedia.org/wikipedia/commons/thumb/c/c1/Flag_of_Hungary.svg/100px-Flag_of_Hungary.svg.png","image":"","mobile_speed":43.38000000000000255},
{"id":16,"name":"Montenegro","capital":"Podgorica","description":"Montenegro, country located in the west-central Balkans at the southern end of the Dinaric Alps. It is bounded by the Adriatic Sea and Croatia (southwest), Bosnia and Herzegovina (northwest), Serbia (northeast), Kosovo (east), and Albania (southeast).\r\n\r\nMontenegro’s administrative capital is Podgorica, though its cultural centre is the historical capital and older city of Cetinje. For much of the 20th century Montenegro was a part of Yugoslavia, and from 2003 to 2006 it was a component of the federated union of Serbia and Montenegro.","continent":"Europe","climate_zone":"CFB = Temperate oceanic climate; coldest month averaging above 0 °C (32 °F), all months with average temperatures below 22 °C (71.6 °F), and at least four months averaging above 10 °C (50 °F). No significant precipitation difference between seasons (neither abovementioned set of conditions fulfilled).","language":"Montenegrin","safety_index":1.772000000000000019,"safety_and_security":"","broadband_speed":57.85000000000000142,"internet_accessibility":"","cost_of_living":2234,"avg_rent_cost":1031,"healthcare_index":null,"cultural_and_recreational_opportunities":"","flag_url":"https://upload.wikimedia.org/wikipedia/commons/thumb/6/64/Flag_of_Montenegro.svg/100px-Flag_of_Montenegro.svg.png","image":"","mobile_speed":44.54999999999999715},
{"id":17,"name":"Latvia","capital":"Riga","description":"Latvia, country of northeastern Europe and the middle of the three Baltic states.\r\n\r\nLatvia, which was occupied and annexed by the U.S.S.R. in June 1940, declared its independence on August 21, 1991. The U.S.S.R. recognized its sovereignty on September 6, and United Nations membership followed shortly thereafter. Latvia was admitted to the North Atlantic Treaty Organization (NATO) and the European Union (EU) in 2004. The capital and chief city is Riga.","continent":"Europe","climate_zone":"DFB = Warm-summer humid continental climate; coldest month averaging below 0 °C (32 °F), all months with average temperatures below 22 °C (71.6 °F), and at least four months averaging above 10 °C (50 °F). No significant precipitation difference between seasons (neither abovementioned set of conditions fulfilled).","language":"Latvian","safety_index":1.582000000000000072,"safety_and_security":"","broadband_speed":73.60999999999999944,"internet_accessibility":"","cost_of_living":1866,"avg_rent_cost":744,"healthcare_index":62.60000000000000142,"cultural_and_recreational_opportunities":"","flag_url":"https://upload.wikimedia.org/wikipedia/commons/thumb/8/84/Flag_of_Latvia.svg/100px-Flag_of_Latvia.svg.png","image":"","mobile_speed":47.3299999999999983},
{"id":19,"name":"North Macedonia","capital":"Skopje","description":"North Macedonia, landlocked country of the south-central Balkans. It is bordered to the north by Kosovo and Serbia, to the east by Bulgaria, to the south by Greece, and to the west by Albania. The capital is Skopje.\r\n\r\nThe Republic of North Macedonia is located in the northern part of the area traditionally known as Macedonia, a geographical region bounded to the south by the Aegean Sea and the Aliákmon River; to the west by Lakes Prespa and Ohrid, the watershed west of the Crni Drim River, and the Šar Mountains; and to the north by the mountains of the Skopska Crna Gora and the watershed between the Morava and Vardar river basins. The Pirin Mountains mark its eastern edge. The Republic of North Macedonia occupies about two-fifths of the entire geographical region of Macedonia. The rest of the region belongs to Greece and Bulgaria. Most people with a Macedonian identity also refer to the region that constitutes North Macedonia as Vardar Macedonia, the Greek part of Macedonia as Aegean Macedonia, and the Bulgarian part of Macedonia as Pirin Macedonia. In this article, unless otherwise indicated, the name Macedonia refers to the present-day state of the Republic of North Macedonia when discussing geography and history since 1913 and to the larger region as described above when used in earlier historical contexts.\r\n\r\nThe region of Macedonia owes its importance neither to its size nor to its population but rather to its location at a major junction of communication routes—in particular, the great north-south route from the Danube River to the Aegean formed by the valleys of the Morava and Vardar rivers and the ancient east-west trade routes connecting the Black Sea and Istanbul with the Adriatic Sea. Although the majority of the republic’s inhabitants are of Slavic descent and heirs to the Eastern Orthodox tradition of Christianity, 500 years of incorporation into the Ottoman Empire left substantial numbers of other ethnic groups, including Albanians, Turks, Vlachs (Aromani), and Roma (Gypsies). Consequently, Macedonia forms a complex border zone between the major cultural traditions of Europe and Asia.\r\n\r\nOttoman control was brought to an end by the Balkan Wars (1912–13), after which Macedonia was divided among Greece, Bulgaria, and Serbia. Following World War I, the Serbian segment was incorporated into the Kingdom of Serbs, Croats, and Slovenes (renamed Yugoslavia in 1929). After World War II the Serbian part of Macedonia became a constituent republic within the Federal People’s Republic of Yugoslavia (later Socialist Federal Republic of Yugoslavia). The collapse of Yugoslavia led the Republic of Macedonia to declare its independence on September 17, 1991.\r\n\r\nThe two major problems facing the newly independent Republic of Macedonia were ensuring for its large Albanian minority the rights of full citizenship and gaining international recognition under its constitutional name and membership in international organizations in the face of strong opposition from Greece, which claimed a monopoly on the use of the term Macedonia. (See Researcher’s Note: Macedonia: a contested name.) After years of largely fruitless UN-mediated negotiations regarding the name issue, in June 2018 Macedonian Prime Minister Zoran Zaev and Greek Prime Minister Alexis Tsipras announced that an agreement (thereafter known as the Prespa Agreement) had been reached under which the Macedonian republic would be known both domestically and internationally as the Republic of North Macedonia (Macedonian: Severna Makedonija). By January 2019 the Macedonian and Greek legislatures had both approved the measures necessary to pave the way for formal adoption of the new name, which came into effect on February 12, 2019.","continent":"Europe","climate_zone":"CFB = Temperate oceanic climate; coldest month averaging above 0 °C (32 °F), all months with average temperatures below 22 °C (71.6 °F), and at least four months averaging above 10 °C (50 °F). No significant precipitation difference between seasons (neither abovementioned set of conditions fulfilled).","language":"Macedonian, Albanian","safety_index":1.713000000000000078,"safety_and_security":"","broadband_speed":31.60000000000000142,"internet_accessibility":"","cost_of_living":null,"avg_rent_cost":null,"healthcare_index":55.10000000000000142,"cultural_and_recreational_opportunities":"","flag_url":"https://upload.wikimedia.org/wikipedia/commons/thumb/7/79/Flag_of_North_Macedonia.svg/100px-Flag_of_North_Macedonia.svg.png","image":"","mobile_speed":66.31000000000000227},
{"id":20,"name":"Thailand","capital":"Bangkok","description":"Thailand, country located in the centre of mainland Southeast Asia. Located wholly within the tropics, Thailand encompasses diverse ecosystems, including the hilly forested areas of the northern frontier, the fertile rice fields of the central plains, the broad plateau of the northeast, and the rugged coasts along the narrow southern peninsula.\r\n\r\nUntil the second half of the 20th century, Thailand was primarily an agricultural country, but since the 1960s increasing numbers of people have moved to Bangkok, the capital, and to other cities. Although the greater Bangkok metropolitan area remains the preeminent urban centre in the country, there are other sizable cities, such as Chiang Mai in the north, Nakhon Ratchasima (Khorat), Khon Kaen, and Udon Thani in the northeast, Pattaya in the southeast, and Hat Yai in the far south.\r\n\r\nSiam, as Thailand was officially called until 1939, was never brought under European colonial domination. Independent Siam was ruled by an absolute monarchy until a revolution there in 1932. Since that time, Thailand has been a constitutional monarchy, and all subsequent constitutions have provided for an elected parliament. Political authority, however, has often been held by the military, which has taken power through coups. During the last two decades of the 20th century and the first decade of the 21st, parliamentary democracy steadily gained wider popular support. Although a crisis emerged in 2006, when the military, aligned with the monarchy, overthrew an elected government, new parliamentary elections were held—as promised by the interim government—in 2007.","continent":"Asia","climate_zone":"AW = Tropical wet and dry or savanna climate; with the driest month having precipitation less than 60 mm (2.4 in) and less than 4% of the total annual precipitation.","language":"Thai","safety_index":2.060999999999999944,"safety_and_security":"","broadband_speed":198.9799999999999898,"internet_accessibility":"","cost_of_living":2136,"avg_rent_cost":1019,"healthcare_index":77.20000000000000284,"cultural_and_recreational_opportunities":"","flag_url":"https://upload.wikimedia.org/wikipedia/commons/thumb/a/a9/Flag_of_Thailand.svg/100px-Flag_of_Thailand.svg.png","image":"","mobile_speed":37.71000000000000085},
{"id":21,"name":"Japan","capital":"Tokyo","description":"Japan, island country lying off the east coast of Asia. It consists of a great string of islands in a northeast-southwest arc that stretches for approximately 1,500 miles (2,400 km) through the western North Pacific Ocean. Nearly the entire land area is taken up by the country’s four main islands; from north to south these are Hokkaido (Hokkaidō), Honshu (Honshū), Shikoku, and Kyushu (Kyūshū). Honshu is the largest of the four, followed in size by Hokkaido, Kyushu, and Shikoku. In addition, there are numerous smaller islands, the major groups of which are the Ryukyu (Nansei) Islands (including the island of Okinawa) to the south and west of Kyushu and the Izu, Bonin (Ogasawara), and Volcano (Kazan) islands to the south and east of central Honshu. The national capital, Tokyo (Tōkyō), in east-central Honshu, is one of the world’s most populous cities.\r\n\r\nMount Fuji from its northern side, Yamanashi prefecture, east-central Honshu, Japan.\r\nThe Japanese landscape is rugged, with more than four-fifths of the land surface consisting of mountains. There are many active and dormant volcanoes, including Mount Fuji (Fuji-san), which, at an elevation of 12,388 feet (3,776 meters), is Japan’s highest mountain. Abundant precipitation and the generally mild temperatures throughout most of the country have produced a lush vegetation cover and, despite the mountainous terrain and generally poor soils, have made it possible to raise a variety of crops. Japan has a large and, to a great extent, ethnically homogeneous population, which is heavily concentrated in the low-lying areas along the Pacific coast of Honshu.\r\n\r\nThe Kinkaku Temple (Golden Pavilion) in Kyōto, Japan, was originally built in the 15th century; the present structure dates to the 1950s.\r\n\r\nTrain of the Sōbu Line passing through Akihabara, a district of Tokyo renowned for its many discount stores selling electric and electronic products.\r\nComplexity and contrast are the keynotes of life in Japan—a country possessing an intricate and ancient cultural tradition yet one that, since 1950, has emerged as one of the world’s most economically and technologically advanced societies. Heavy emphasis is placed on education, and Japan is one of the world’s most literate countries. Tension between old and new is apparent in all phases of Japanese life. A characteristic sensitivity to natural beauty and a concern with form and balance are evident in such cities as Kyōto and Nara, as well as in Japan’s ubiquitous gardens. Even in the countryside, however, the impact of rapid Westernization is evident in many aspects of Japanese life. The agricultural regions are characterized by low population densities and well-ordered rice fields and fruit orchards, whereas the industrial and urbanized belt along the Pacific coast of Honshu is noted for its highly concentrated population, heavy industrialization, and environmental pollution.","continent":"Asia","climate_zone":"DFB = Warm-summer humid continental climate; coldest month averaging below 0 °C (32 °F), all months with average temperatures below 22 °C (71.6 °F), and at least four months averaging above 10 °C (50 °F). No significant precipitation difference between seasons (neither abovementioned set of conditions fulfilled).","language":"Japanese","safety_index":1.336000000000000076,"safety_and_security":"","broadband_speed":143.3300000000000125,"internet_accessibility":"","cost_of_living":2611,"avg_rent_cost":1195,"healthcare_index":79.29999999999999716,"cultural_and_recreational_opportunities":"","flag_url":"https://upload.wikimedia.org/wikipedia/commons/thumb/9/9e/Flag_of_Japan.svg/100px-Flag_of_Japan.svg.png","image":"","mobile_speed":42.8299999999999983},
{"id":22,"name":"South Korea","capital":"Seoul","description":"South Korea, country in East Asia. It occupies the southern portion of the Korean peninsula. The country is bordered by the Democratic People’s Republic of Korea (North Korea) to the north, the East Sea (Sea of Japan) to the east, the East China Sea to the south, and the Yellow Sea to the west; to the southeast it is separated from the Japanese island of Tsushima by the Korea Strait. South Korea makes up about 45 percent of the peninsula’s land area. The capital is Seoul (Sŏul).\r\n\r\nNamdaemun (“Great South Gate”), Seoul; it was restored after its 2008 destruction and reopened in 2013.\r\nSouth Korea faces North Korea across a demilitarized zone (DMZ) 2.5 miles (4 km) wide that was established by the terms of the 1953 armistice that ended fighting in the Korean War (1950–53). The DMZ, which runs for about 150 miles (240 km), constitutes the 1953 military cease-fire line and roughly follows latitude 38° N (the 38th parallel) from the mouth of the Han River on the west coast of the Korean peninsula to a little south of the North Korean town of Kosŏng on the east coast.","continent":"Asia","climate_zone":"DWB = Monsoon-influenced warm-summer humid continental climate; coldest month averaging below 0 °C (32 °F), all months with average temperatures below 22 °C (71.6 °F), and at least four months averaging above 10 °C (50 °F). At least ten times as much rain in the wettest month of summer as in the driest month of winter (an alternative definition is 70% or more of average annual precipitation is received in the warmest six months).","language":"Korean","safety_index":1.762999999999999901,"safety_and_security":"","broadband_speed":95.7399999999999949,"internet_accessibility":"","cost_of_living":null,"avg_rent_cost":null,"healthcare_index":82.70000000000000284,"cultural_and_recreational_opportunities":"","flag_url":"https://upload.wikimedia.org/wikipedia/commons/thumb/0/09/Flag_of_South_Korea.svg/100px-Flag_of_South_Korea.svg.png","image":"","mobile_speed":122.5499999999999972},
{"id":23,"name":"Malaysia","capital":"Kuala Lumpur","description":"Malaysia, country of Southeast Asia, lying just north of the Equator, that is composed of two noncontiguous regions: Peninsular Malaysia (Semenanjung Malaysia), also called West Malaysia (Malaysia Barat), which is on the Malay Peninsula, and East Malaysia (Malaysia Timur), which is on the island of Borneo. The Malaysian capital, Kuala Lumpur, lies in the western part of the peninsula, about 25 miles (40 km) from the coast; the administrative centre, Putrajaya, is located about 16 miles (25 km) south of the capital.\r\n\r\nMalaysia, a member of the Commonwealth, represents the political marriage of territories that were formerly under British rule. When it was established on September 16, 1963, Malaysia comprised the territories of Malaya (now Peninsular Malaysia), the island of Singapore, and the colonies of Sarawak and Sabah in northern Borneo. In August 1965 Singapore seceded from the federation and became an independent republic.","continent":"Asia","climate_zone":"AF = Tropical rainforest climate; average precipitation of at least 60 mm (2.4 in) in every month.","language":"Malay","safety_index":1.512999999999999901,"safety_and_security":"","broadband_speed":90.89000000000000056,"internet_accessibility":"","cost_of_living":1373,"avg_rent_cost":603,"healthcare_index":70.09999999999999431,"cultural_and_recreational_opportunities":"","flag_url":"https://upload.wikimedia.org/wikipedia/commons/thumb/6/66/Flag_of_Malaysia.svg/100px-Flag_of_Malaysia.svg.png","image":"","mobile_speed":43.46000000000000085},
{"id":24,"name":"Vietnam","capital":"Hanoi","description":"Vietnam, country occupying the eastern portion of mainland Southeast Asia.\r\n\r\nTribal Viets inhabiting the Red River delta entered written history when China’s southward expansion reached them in the 3rd century BCE. From that time onward, a dominant theme of Vietnam’s history has been interaction with China, the source of most of Vietnam’s high culture. As a tribute-paying state after throwing off Chinese rule in 938 CE, Vietnam sent lacquerware, animal skins, ivory, and tropical products to the Chinese emperor and received scrolls on philosophy, administration, and literature in return. Sinic culture seeped deeply into society, but it shaped the aristocracy and mandarinal families more than it did the peasantry, which preserved distinctive customs, beliefs, vocabulary, lifeways, and gender relations. Modeling themselves on Chinese emperors, Vietnam’s kings exacted tribute from ethnic minorities on the periphery of the Vietnamese state and called themselves emperors when not addressing the Chinese court. Although cultural and spatial gaps between the Vietnamese court and the farthest reaches of society were not as great as they were in China (Vietnam is about the size of a Chinese province, with a comparable population), the Vietnamese state’s capacity to rule diminished with distance from the capital. The refractory character of bamboo-hedged peasant communes was captured in the cliché, \"The emperor’s writ stops at the village gate.\"\r\n\r\nVietnam has a long history of affiliating with a dominant civilization and adapting that civilization’s ideas, institutions, and technology to Vietnamese purposes. This pattern of affiliating and adapting was already evident in Vietnam’s historical relations with China, and it reappeared as descendants of mandarins responded to the challenge of the West by rejecting tradition and becoming communists to combat colonialism. The pattern was evident again as it animated 20th-century artistic movements that employed Western forms to promote social renovation; and since the 1980s it has been the driving force behind the Vietnam Communist Party’s embrace of economic liberalization and integration into the world economy. Such strategic absorption and adaptation have helped propel Vietnam to become one of the world’s most populous countries, with one of the most rapidly expanding market economies.\r\n\r\nThe capital, Hanoi, is located in the north, while the country’s largest city, Ho Chi Minh City (formerly Saigon), is in the south. Vietnam experienced a period of prolonged warfare in the mid-20th century, and a partitioning (1954–75), first militarily and later politically, into the Democratic Republic of Vietnam, better known as North Vietnam, and the Republic of Vietnam, usually called South Vietnam. Following reunification in April 1975, the Socialist Republic of Vietnam was established in July 1976.","continent":"Asia","climate_zone":"CWA = Monsoon-influenced humid subtropical climate; coldest month averaging above 0 °C (32 °F) and at least one month’s average temperature above 22 °C (71.6 °F) and at least four months averaging above 10 °C (50 °F). At least ten times as much rain in the wettest month of summer as in the driest month of winter (an alternative definition is 70% or more of average annual precipitation is received in the warmest six months).","language":"Vietnamese","safety_index":1.745000000000000106,"safety_and_security":"","broadband_speed":82.21999999999999887,"internet_accessibility":"","cost_of_living":1662,"avg_rent_cost":762,"healthcare_index":60.79999999999999716,"cultural_and_recreational_opportunities":"","flag_url":"https://upload.wikimedia.org/wikipedia/commons/thumb/2/21/Flag_of_Vietnam.svg/100px-Flag_of_Vietnam.svg.png","image":"","mobile_speed":42.07000000000000028},
{"id":25,"name":"Taiwan","capital":"Taipei","description":"Taiwan, island in the western Pacific Ocean that lies roughly 100 miles (160 km) off the coast of southeastern China. It is approximately 245 miles (395 km) long (north-south) and 90 miles (145 km) across at its widest point. Taipei, in the north, is the seat of government of the Republic of China (ROC; Nationalist China). In addition to the main island, the ROC government has jurisdiction over 22 islands in the Taiwan group and 64 islands to the west in the P’eng-hu (Pescadores) archipelago. Two island groups controlled by the ROC government, Matsu and Quemoy, lie just off the coast of China’s Fujian (Fukien) province. In the East China Sea, the ROC claims the group of islands it calls Diaoyutai, which also are claimed by Japan as Senkaku and by the People’s Republic of China as Diaoyu. Moreover, in the South China Sea, the ROC’s claim to the Paracels is disputed with the People’s Republic of China and Vietnam, whereas a larger group of countries—the People’s Republic of China, Vietnam, Malaysia, and the Philippines, in addition to the ROC—all claim the Spratly Islands.\r\n\r\nPrior to the 1600s, Taiwan was self-governing, although there was no central ruling authority. It was a colony of the Netherlands for about 40 years in the early to mid-17th century and was subsequently independent again for about two decades. China gained control there in the late 17th century and ruled Taiwan for some two centuries. Japan acquired Taiwan in 1895 following the first Sino-Japanese War, and it became a colony.\r\n\r\nTaiwan was returned to Nationalist Chinese control in 1945 following Japan’s defeat in World War II. However, in 1949 Chinese communist armies defeated Nationalist forces on the mainland and established the People’s Republic of China there. The Nationalist government and armies fled to Taiwan, again resulting in the separation of Taiwan from China. In the ensuing years the ROC claimed jurisdiction over the Chinese mainland as well as Taiwan, although in the early 1990s Taiwan’s government dropped this claim to China. The Chinese government in Beijing has maintained that it has jurisdiction over Taiwan and has continued to propound a one-China policy—a position that few countries in the world dispute. There has been no agreement, however, on how or when, if ever, the two entities will be reunified.","continent":"Asia","climate_zone":"CWB = Subtropical highland climate or temperate oceanic climate with dry winters; coldest month averaging above 0 °C (32 °F), all months with average temperatures below 22 °C (71.6 °F), and at least four months averaging above 10 °C (50 °F). At least ten times as much rain in the wettest month of summer as in the driest month of winter (an alternative definition is 70% or more of average annual precipitation received in the warmest six months).","language":"Mandarin Chinese","safety_index":1.649000000000000021,"safety_and_security":"","broadband_speed":125.1899999999999978,"internet_accessibility":"","cost_of_living":null,"avg_rent_cost":null,"healthcare_index":86,"cultural_and_recreational_opportunities":"","flag_url":"https://upload.wikimedia.org/wikipedia/commons/thumb/7/72/Flag_of_the_Republic_of_China.svg/100px-Flag_of_the_Republic_of_China.svg.png","image":"","mobile_speed":69.62999999999999546},
{"id":26,"name":"Sri Lanka","capital":"Colombo","description":"Sri Lanka, island country lying in the Indian Ocean and separated from peninsular India by the Palk Strait. It is located between latitudes 5°55′ and 9°51′ N and longitudes 79°41′ and 81°53′ E and has a maximum length of 268 miles (432 km) and a maximum width of 139 miles (224 km).\r\n\r\nProximity to the Indian subcontinent has facilitated close cultural interaction between Sri Lanka and India from ancient times. At a crossroads of maritime routes traversing the Indian Ocean, Sri Lanka has also been exposed to cultural influences from other Asian civilizations. Ancient Greek geographers called it Taprobane. Arabs referred to it as Serendib. Later European mapmakers called it Ceylon, a name still used occasionally for trade purposes. It officially became Sri Lanka in 1972.\r\n\r\nDalada Maligava (“Temple of the Tooth”), where a tooth of the Buddha is believed to be preserved, Kandy, Sri Lanka.\r\nThe distinctive civilization of Sri Lanka, with roots that can be traced back to the 6th century BCE, is characterized by two factors: the preservation of Theravada Buddhism (the orthodox school of Buddhism having its literary traditions in the Pali language) and the development over two millennia of a sophisticated system of irrigation in the drier parts of the country. This civilization was further enriched by the influences of Hinduism and Islam.\r\n\r\nIn 1948, after nearly 150 years of British rule, Sri Lanka became an independent country, and it was admitted to the United Nations seven years later. The country is a member of the Commonwealth and the South Asian Association for Regional Cooperation.\r\n\r\nColombo, which emerged as the main urban centre during British rule, remains the executive and judicial capital of Sri Lanka; Sri Jayewardenepura Kotte, a Colombo suburb, is the legislative capital. For administrative purposes, the country has been divided into nine provinces and subdivided into 25 districts.\r\n\r\nSri Lanka is densely populated. The majority of its people are poor, live in rural areas, and depend on agriculture for their livelihood. A physical environment of wide-ranging diversity makes Sri Lanka one of the world’s most scenic countries. As the home of several ethnic groups, each with its own cultural heritage, Sri Lanka also has a highly varied cultural landscape.","continent":"Asia","climate_zone":"AF = Tropical rainforest climate; average precipitation of at least 60 mm (2.4 in) in every month.","language":"Sinhala, Tamil","safety_index":2.13600000000000012,"safety_and_security":"","broadband_speed":20.03000000000000113,"internet_accessibility":"","cost_of_living":1401,"avg_rent_cost":634,"healthcare_index":71.09999999999999431,"cultural_and_recreational_opportunities":"","flag_url":"https://upload.wikimedia.org/wikipedia/commons/thumb/1/11/Flag_of_Sri_Lanka.svg/100px-Flag_of_Sri_Lanka.svg.png","image":"","mobile_speed":14.71000000000000085},
{"id":28,"name":"South Africa","capital":"Cape Town","description":"South Africa, the southernmost country on the African continent, renowned for its varied topography, great natural beauty, and cultural diversity, all of which have made the country a favoured destination for travelers since the legal ending of apartheid (Afrikaans: “apartness,” or racial separation) in 1994.\r\n\r\nSouth Africa’s remoteness—it lies thousands of miles distant from major African cities such as Lagos and Cairo and more than 6,000 miles (10,000 km) away from most of Europe, North America, and eastern Asia, where its major trading partners are located—helped reinforce the official system of apartheid for a large part of the 20th century. With that system, the government, controlled by the minority white population, enforced segregation between government-defined races in housing, education, and virtually all spheres of life, creating in effect three nations: one of whites (consisting of peoples primarily of British and Dutch [Boer] ancestry, who struggled for generations to gain political supremacy, a struggle that reached its violent apex with the South African War of 1899–1902); one of Blacks (consisting of such peoples as the San hunter-gatherers of the northwestern desert, the Zulu herders of the eastern plateaus, and the Khoekhoe farmers of the southern Cape regions); and one of “Coloureds” (mixed-race people) and ethnic Asians (Indians, Malays, Filipinos, and Chinese). The apartheid regime was disdained and even vehemently opposed by much of the world community, and by the mid-1980s South Africa found itself among the world’s pariah states, the subject of economic and cultural boycotts that affected almost every aspect of life. During this era the South African poet Mongane Wally Serote remarked,\r\n\r\nThere is an intense need for self-expression among the oppressed in our country. When I say self-expression I don’t mean people saying something about themselves. I mean people making history consciously….We neglect the creativity that has made the people able to survive extreme exploitation and oppression. People have survived extreme racism. It means our people have been creative about their lives.\r\n\r\nEventually forced to confront the untenable nature of ethnic separatism in a multicultural land, the South African government of F.W. de Klerk (1989–94) began to repeal apartheid laws. That process in turn set in motion a transition toward universal suffrage and a true electoral democracy, which culminated in the 1994 election of a government led by the Black majority under the leadership of the long-imprisoned dissident Nelson Mandela. As this transition attests, the country has made remarkable progress in establishing social equity in a short period of time.\r\n\r\nSouth Africa has three cities that serve as capitals: Pretoria (executive), Cape Town (legislative), and Bloemfontein (judicial). Johannesburg, the largest urban area in the country and a centre of commerce, lies at the heart of the populous Gauteng province. Durban, a port on the Indian Ocean, is a major industrial centre. East London and Port Elizabeth, both of which lie along the country’s southern coast, are important commercial, industrial, and cultural centres.\r\n\r\nToday South Africa enjoys a relatively stable mixed economy that draws on its fertile agricultural lands, abundant mineral resources, tourist attractions, and highly evolved intellectual capital. Greater political equality and economic stability, however, do not necessarily mean social tranquility. South African society at the start of the 21st century continued to face steep challenges: rising crime rates, ethnic tensions, great disparities in housing and educational opportunities, and the AIDS pandemic.","continent":"Africa","climate_zone":"BWK = Cold desert climate","language":"Zulu, Afrikaans, Xhosa, English","safety_index":2.404999999999999805,"safety_and_security":"","broadband_speed":40.60000000000000142,"internet_accessibility":"","cost_of_living":1578,"avg_rent_cost":691,"healthcare_index":64,"cultural_and_recreational_opportunities":"","flag_url":"https://upload.wikimedia.org/wikipedia/commons/thumb/a/af/Flag_of_South_Africa.svg/100px-Flag_of_South_Africa.svg.png","image":"","mobile_speed":32.9200000000000017},
{"id":29,"name":"Mauritius","capital":"Port Louis","description":"Mauritius, island country in the Indian Ocean, located off the eastern coast of Africa. Physiographically, it is part of the Mascarene Islands. The capital is Port Louis.","continent":"Africa","climate_zone":"AM = Tropical monsoon climate; driest month (which nearly always occurs at or soon after the “winter” solstice for that side of the equator) with precipitation less than 60 mm (2.4 in), but more than 4% the total annual precipitation.","language":"English","safety_index":1.54600000000000004,"safety_and_security":"","broadband_speed":27.39000000000000056,"internet_accessibility":"","cost_of_living":1744,"avg_rent_cost":789,"healthcare_index":null,"cultural_and_recreational_opportunities":"","flag_url":"https://upload.wikimedia.org/wikipedia/commons/thumb/7/77/Flag_of_Mauritius.svg/100px-Flag_of_Mauritius.svg.png","image":"","mobile_speed":26.89000000000000056},
{"id":30,"name":"Seychelles","capital":"Victoria","description":"Seychelles, island republic in the western Indian Ocean, comprising about 115 islands, with lush tropical vegetation, beautiful beaches, and a wide variety of marine life. Situated between latitudes 4° and 11° S and longitudes 46° and 56° E, the major islands of Seychelles are located about 1,000 miles (1,600 km) east of Kenya and about 700 miles (1,100 km) northeast of Madagascar. The capital, Victoria, is situated on the island of Mahé.","continent":"Africa","climate_zone":"AF = Tropical rainforest climate; average precipitation of at least 60 mm (2.4 in) in every month.","language":"French, Seychellois Creole, English","safety_index":null,"safety_and_security":"","broadband_speed":24.10000000000000142,"internet_accessibility":"","cost_of_living":3058,"avg_rent_cost":1392,"healthcare_index":null,"cultural_and_recreational_opportunities":"","flag_url":"https://upload.wikimedia.org/wikipedia/commons/thumb/f/fc/Flag_of_Seychelles.svg/100px-Flag_of_Seychelles.svg.png","image":"","mobile_speed":null},
{"id":31,"name":"Namibia","capital":"Windhoek","description":"","continent":"Africa","climate_zone":"","language":null,"safety_index":null,"safety_and_security":"","broadband_speed":7.589999999999999858,"internet_accessibility":"","cost_of_living":null,"avg_rent_cost":null,"healthcare_index":null,"cultural_and_recreational_opportunities":"","flag_url":"https://upload.wikimedia.org/wikipedia/commons/thumb/0/00/Flag_of_Namibia.svg/100px-Flag_of_Namibia.svg.png","image":"","mobile_speed":16.08999999999999986},
{"id":36,"name":"Croatia","capital":"Zagreb","description":"Croatia, country located in the northwestern part of the Balkan Peninsula. It is a small yet highly geographically diverse crescent-shaped country. Its capital is Zagreb, located in the north.\r\n\r\nThe walled old city of Dubrovnik, Croatia, on the Adriatic Sea.\r\nThe present-day republic is composed of the historically Croatian regions of Croatia-Slavonia (located in the upper arm of the country), Istria (centred on the Istrian Peninsula on the northern Adriatic coast), and Dalmatia (corresponding to the coastal strip). Although these regions were ruled for centuries by various foreign powers, they remained firmly Western-oriented in culture, acquiring a legacy of Roman law, the Latin alphabet, and western European political and economic traditions and institutions. A part of Yugoslavia for much of the 20th century, Croatia suffered considerably from the disintegration of that federation in the early 1990s. The European trajectory of Croatia was finally realized in 2013 when it joined the European Union; in 2023 Croatia adopted the euro as its currency.\r\n\r\nAs the Croatian Canadian scholar Tony Fabijančić writes, Croatia’s tumultuous first years as an independent country also have obscured its centuries-long history:\r\n\r\nCroatia (Hrvatska) is an ancient nation, yet a very young nation state. Once a formidable kingdom under Tomislav in the tenth century, a naval power in the sixteenth and seventeenth, and an awakening national entity in the nineteenth, it had to endure a thousand years of foreign meddling, subjugation, incursions, and outright wars before being recognized in 1992 as a distinct entity.","continent":"Europe","climate_zone":"CFB = Temperate oceanic climate; coldest month averaging above 0 °C (32 °F), all months with average temperatures below 22 °C (71.6 °F), and at least four months averaging above 10 °C (50 °F). No significant precipitation difference between seasons (neither abovementioned set of conditions fulfilled).","language":"Croatian","safety_index":1.449999999999999956,"safety_and_security":"","broadband_speed":45.53000000000000113,"internet_accessibility":"","cost_of_living":1871,"avg_rent_cost":764,"healthcare_index":65.09999999999999431,"cultural_and_recreational_opportunities":"","flag_url":"https://upload.wikimedia.org/wikipedia/commons/thumb/1/1b/Flag_of_Croatia.svg/100px-Flag_of_Croatia.svg.png","image":"country_images/Croatia_ZsTWd0C.jpg","mobile_speed":74.37000000000000454},
{"id":37,"name":"Germany","capital":"Berlin","description":"Germany, country of north-central Europe, traversing the continent’s main physical divisions, from the outer ranges of the Alps northward across the varied landscape of the Central German Uplands and then across the North German Plain.\r\n\r\nOne of Europe’s largest countries, Germany encompasses a wide variety of landscapes: the tall, sheer mountains of the south; the sandy, rolling plains of the north; the forested hills of the urbanized west; and the plains of the agricultural east. At the spiritual heart of the country is the magnificent east-central city of Berlin, which rose phoenixlike from the ashes of World War II and now, after decades of partition, is the capital of a reunified Germany, and the Rhine River, which flows northward from Switzerland and is celebrated in visual art, literature, folklore, and song. Along its banks and those of its principal tributaries—among them the Neckar, Main, Moselle, and Ruhr—stand hundreds of medieval castles, churches, picturesque villages, market towns, and centres of learning and culture, including Heidelberg, the site of one of Europe’s oldest universities (founded in 1386), and Mainz, historically one of Europe’s most important publishing centres. All are centrepieces of Germany’s thriving tourist economy, which brings millions of visitors to the country each year, drawn by its natural beauty, history, culture, and cuisine (including its renowned wines and beers).\r\n\r\nThe name Germany has long described not a particular place but the loose, fluid polity of Germanic-speaking peoples that held sway over much of western Europe north of the Alps for millennia. Although Germany in that sense is an ancient entity, the German nation in more or less its present form came into being only in the 19th century, when Prussian Prime Minister Otto von Bismarck brought together dozens of German-speaking kingdoms, principalities, free cities, bishoprics, and duchies to form the German Empire in 1871. This so-called Second Reich quickly became Europe’s leading power and acquired colonies in Africa, Asia, and the Pacific. That overseas empire was dismantled following Germany’s defeat in World War I and the abdication of Emperor William II. Economic depression, widespread unemployment, and political strife that verged on civil war followed, leading to the collapse of the progressive Weimar Republic and the rise of the Nazi Party under Adolf Hitler. After gaining power in 1933, Hitler established the Third Reich and soon thereafter embarked on a ruinous crusade to conquer Europe and exterminate Jews, Roma (Gypsies), homosexuals, and others.","continent":"Europe","climate_zone":"CFB = Temperate oceanic climate; coldest month averaging above 0 °C (32 °F), all months with average temperatures below 22 °C (71.6 °F), and at least four months averaging above 10 °C (50 °F). No significant precipitation difference between seasons (neither abovementioned set of conditions fulfilled).","language":"German","safety_index":1.455999999999999961,"safety_and_security":"","broadband_speed":80.0799999999999983,"internet_accessibility":"","cost_of_living":3340,"avg_rent_cost":1494,"healthcare_index":71.70000000000000284,"cultural_and_recreational_opportunities":"","flag_url":"https://upload.wikimedia.org/wikipedia/commons/thumb/b/ba/Flag_of_Germany.svg/100px-Flag_of_Germany.svg.png","image":"","mobile_speed":58.8299999999999983},
{"id":39,"name":"Estonia","capital":"Tallinn","description":"Estonia, country in northeastern Europe, the northernmost of the three Baltic states. Estonia’s area includes some 1,500 islands and islets; the two largest of these islands, Saaremaa and Hiiumaa, are off mainland Estonia’s west coast.\r\n\r\nEstonia has been dominated by foreign powers through much of its history. In 1940 it was forcibly incorporated into the U.S.S.R. as one of its constituent republics. Estonia remained a Soviet republic until 1991, when, along with the other Baltic states, it declared its independence. The Soviet Union recognized independence for Estonia and the other Baltic states on September 6, 1991, and United Nations membership followed shortly thereafter. Estonia set about transforming its government into a parliamentary democracy and reorienting its economy toward market capitalism. It sought integration with greater Europe and in 2004 joined the North Atlantic Treaty Organization (NATO) and the European Union (EU).","continent":"Europe","climate_zone":"DFB = Warm-summer humid continental climate; coldest month averaging below 0 °C (32 °F), all months with average temperatures below 22 °C (71.6 °F), and at least four months averaging above 10 °C (50 °F). No significant precipitation difference between seasons (neither abovementioned set of conditions fulfilled).","language":"Estonian","safety_index":1.562999999999999945,"safety_and_security":"","broadband_speed":59.97999999999999688,"internet_accessibility":"","cost_of_living":2186,"avg_rent_cost":917,"healthcare_index":76.29999999999999716,"cultural_and_recreational_opportunities":"","flag_url":"https://upload.wikimedia.org/wikipedia/commons/thumb/8/8f/Flag_of_Estonia.svg/100px-Flag_of_Estonia.svg.png","image":"","mobile_speed":56.25999999999999802},
{"id":42,"name":"France","capital":"Paris","description":"France, country of northwestern Europe. Historically and culturally among the most important nations in the Western world, France has also played a highly significant role in international affairs, with former colonies in every corner of the globe. Bounded by the Atlantic Ocean and the Mediterranean Sea, the Alps and the Pyrenees, France has long provided a geographic, economic, and linguistic bridge joining northern and southern Europe. It is Europe’s most important agricultural producer and one of the world’s leading industrial powers.\r\n\r\nFrance is among the globe’s oldest nations, the product of an alliance of duchies and principalities under a single ruler in the Middle Ages. Today, as in that era, central authority is vested in the state, even though a measure of autonomy has been granted to the country’s régions in recent decades. The French people look to the state as the primary guardian of liberty, and the state in turn provides a generous program of amenities for its citizens, from free education to health care and pension plans. Even so, this centralist tendency is often at odds with another long-standing theme of the French nation: the insistence on the supremacy of the individual. On this matter historian Jules Michelet remarked, “England is an empire, Germany is a nation, a race, France is a person.” Statesman Charles de Gaulle, too, famously complained, “Only peril can bring the French together. One can’t impose unity out of the blue on a country that has 265 kinds of cheese.”\r\n\r\nThis tendency toward individualism joins with a pluralist outlook and a great interest in the larger world. Even though its imperialist stage was driven by the impulse to civilize that world according to French standards (la mission civilisatrice), the French still note approvingly the words of writer Gustave Flaubert:\r\n\r\nI am no more modern than I am ancient, no more French than Chinese; and the idea of la patrie, the fatherland—that is, the obligation to live on a bit of earth coloured red or blue on a map, and to detest the other bits coloured green or black—has always seemed to me narrow, restricted, and ferociously stupid.","continent":"Europe","climate_zone":"CFB = Temperate oceanic climate; coldest month averaging above 0 °C (32 °F), all months with average temperatures below 22 °C (71.6 °F), and at least four months averaging above 10 °C (50 °F). No significant precipitation difference between seasons (neither abovementioned set of conditions fulfilled).","language":"French","safety_index":1.939000000000000056,"safety_and_security":"","broadband_speed":148.6800000000000068,"internet_accessibility":"","cost_of_living":2836,"avg_rent_cost":1212,"healthcare_index":78.09999999999999431,"cultural_and_recreational_opportunities":"","flag_url":"https://upload.wikimedia.org/wikipedia/commons/thumb/c/c3/Flag_of_France.svg/100px-Flag_of_France.svg.png","image":"","mobile_speed":63.67999999999999972},
{"id":47,"name":"Georgia","capital":"Tbilisi","description":"Georgia, country of Transcaucasia located at the eastern end of the Black Sea on the southern flanks of the main crest of the Greater Caucasus Mountains. It is bounded on the north and northeast by Russia, on the east and southeast by Azerbaijan, on the south by Armenia and Turkey, and on the west by the Black Sea. Georgia includes three ethnic enclaves: Abkhazia, in the northwest (principal city Sokhumi); Ajaria, in the southwest (principal city Batʿumi); and South Ossetia, in the north (principal city Tskhinvali). The capital of Georgia is Tbilisi (Tiflis).\r\n\r\nThe roots of the Georgian people extend deep in history; their cultural heritage is equally ancient and rich. During the medieval period a powerful Georgian kingdom existed, reaching its height between the 10th and 13th centuries. After a long period of Turkish and Persian domination, Georgia was annexed by the Russian Empire in the 19th century. An independent Georgian state existed from 1918 to 1921, when it was incorporated into the Soviet Union. In 1936 Georgia became a constituent (union) republic and continued as such until the collapse of the Soviet Union. During the Soviet period the Georgian economy was modernized and diversified. One of the most independence-minded republics, Georgia declared sovereignty on November 19, 1989, and independence on April 9, 1991.\r\n\r\nThe 1990s were a period of instability and civil unrest in Georgia, as the first postindependence government was overthrown and separatist movements emerged in South Ossetia and Abkhazia.","continent":"Asia","climate_zone":"CFA = Humid subtropical climate; coldest month averaging above 0 °C (32 °F) and at least one month’s average temperature above 22 °C (71.6 °F) and at least four months averaging above 10 °C (50 °F). No significant precipitation difference between seasons . No dry months in the summer (neither abovementioned set of conditions fulfilled).","language":"Georgian","safety_index":2.071000000000000175,"safety_and_security":"","broadband_speed":25.41000000000000014,"internet_accessibility":"","cost_of_living":2160,"avg_rent_cost":1039,"healthcare_index":54.5,"cultural_and_recreational_opportunities":"","flag_url":"https://upload.wikimedia.org/wikipedia/commons/thumb/0/0f/Flag_of_Georgia.svg/100px-Flag_of_Georgia.svg.png","image":"","mobile_speed":33.70000000000000285},
{"id":51,"name":"Albania","capital":"Tirana","description":"Albania, country in southern Europe, located in the western part of the Balkan Peninsula on the Strait of Otranto, the southern entrance to the Adriatic Sea. The capital city is Tirana (Tiranë).\r\nAlbanians refer to themselves as shqiptarë—often taken to mean “sons of eagles,” though it may well refer to “those associated with the shqip (i.e., Albanian) language”—and to their country as Shqipëria. They generally consider themselves to be descendants of the ancient Illyrians, who lived in central Europe and migrated southward to the territory of Albania at the beginning of the Bronze Age, about 2000 BCE. They have lived in relative isolation and obscurity through most of their difficult history, in part because of the rugged terrain of their mountainous land but also because of a complex of historical, cultural, and social factors.\r\nBecause of its location on the Adriatic and Ionian seas, Albania has long served as a bridgehead for various nations and empires seeking conquest abroad. In the 2nd century BCE the Illyrians were conquered by the Romans, and from the end of the 4th century CE they were ruled by the Byzantine Empire. After suffering centuries of invasion by Visigoths, Huns, Bulgars, and Slavs, the Albanians were finally conquered by the Ottoman Turks in the 15th century. Ottoman rule cut off Albania from Western civilization for more than four centuries, but in the late 19th century the country began to remove itself from Ottoman influence and to rediscover old affinities and common interests with the West.","continent":"Europe","climate_zone":"Csb = Warm-summer Mediterranean climate; coldest month averaging above 0 °C (32 °F), all months with average temperatures below 22 °C (71.6 °F), and at least four months averaging above 10 °C (50 °F). At least three times as much precipitation in the wettest month of winter as in the driest month of summer, and driest month of summer receives less than 30 mm (1.2 in).","language":"Albanian","safety_index":1.745000000000000106,"safety_and_security":"","broadband_speed":43.52000000000000313,"internet_accessibility":"","cost_of_living":1614,"avg_rent_cost":652,"healthcare_index":49.5,"cultural_and_recreational_opportunities":"","flag_url":"https://upload.wikimedia.org/wikipedia/commons/thumb/3/36/Flag_of_Albania.svg/100px-Flag_of_Albania.svg.png","image":"country_images/Albania_0I0E47m.jpg","mobile_speed":39.74000000000000198},
{"id":52,"name":"Cyprus","capital":"Nicosia","description":"Cyprus, island in the eastern Mediterranean Sea renowned since ancient times for its mineral wealth, superb wines and produce, and natural beauty.\r\n\r\nA “golden-green leaf thrown into the Sea” and a land of “wild weather and volcanoes,” in the words of the Greek Cypriot poet Leonidas Malenis, Cyprus comprises tall mountains, fertile valleys, and wide beaches. Settled for more than 10 millennia, Cyprus stands at a cultural, linguistic, and historic crossroads between Europe and Asia. Its chief cities—the capital of Nicosia, Limassol, Famagusta, and Paphos—have absorbed the influences of generations of conquerors, pilgrims, and travelers and have an air that is both cosmopolitan and provincial. Today Cyprus is a popular tourist destination for visitors from Europe, favoured by honeymooners (as befits the legendary home of Aphrodite, the ancient Greek goddess of love), bird-watchers drawn by the island’s diversity of migratory species, and other vacationers.\r\n\r\nPetra tou Romiou, the legendary site of Aphrodite's emergence from the sea, near Old Paphos, Cyprus.\r\nIn 1960 Cyprus became independent of Britain (it had been a crown colony since 1925) as the Republic of Cyprus. The long-standing conflict between the Greek Cypriot majority and the Turkish Cypriot minority and an invasion of the island by Turkish troops in 1974 produced an actual—although internationally unrecognized—partition of the island and led to the establishment in 1975 of a de facto Turkish Cypriot state in the northern third of the country. The Turkish Cypriot state made a unilateral declaration of independence in 1983 and adopted the name Turkish Republic of Northern Cyprus. Its independence was recognized only by Turkey.","continent":"Asia","climate_zone":"","language":"Greek, Turkish","safety_index":1.903999999999999915,"safety_and_security":"","broadband_speed":38.02000000000000313,"internet_accessibility":"","cost_of_living":2649,"avg_rent_cost":1246,"healthcare_index":57.20000000000000284,"cultural_and_recreational_opportunities":"","flag_url":"https://upload.wikimedia.org/wikipedia/commons/thumb/d/d4/Flag_of_Cyprus.svg/100px-Flag_of_Cyprus.svg.png","image":"country_images/Cyprus_cV7HjQ1.jpg","mobile_speed":73.23999999999999489},
{"id":53,"name":"Serbia","capital":"Belgrade","description":"Serbia, landlocked country in the west-central Balkans. For most of the 20th century, it was a part of Yugoslavia.\r\n\r\nThe capital of Serbia is Belgrade (Beograd), a cosmopolitan city at the confluence of the Danube and Sava rivers; Stari Grad, Belgrade’s old town, is dominated by an ancient fortress called the Kalemegdan and includes well-preserved examples of medieval architecture and some of eastern Europe’s most-renowned restaurants. Serbia’s second city, Novi Sad, lies upstream on the Danube; a cultural and educational centre, it resembles the university towns of nearby Hungary in many respects.\r\n\r\nThe historical boundaries of Yugoslavia from 1919 to 1992.\r\nBeginning in the 1920s, Serbia was an integral part of Yugoslavia (meaning “Land of the South Slavs”), which included the modern countries of Serbia, Croatia, Slovenia, Bosnia and Herzegovina, Kosovo, North Macedonia, and Montenegro. Long ruled in turn by the Ottoman Empire and Austria-Hungary, these component nations combined in 1918 to form an independent federation known as the Kingdom of Serbs, Croats, and Slovenes. In 1929 that federation was formally constituted as Yugoslavia. Serbia was the dominant part in this multiethnic union, though after World War II the nonaligned communist government of Josip Broz Tito accorded some measure of autonomy to the constituent republics and attempted to balance contending interests by dividing national administrative responsibilities (e.g., for intelligence and defense) along ethnic lines.\r\n\r\nAfter Tito’s death in 1980 and the collapse of communism in eastern Europe over the course of the following decade, resurgent nationalism reopened old rifts in Yugoslav society. Serbian (and later Yugoslav) leader Slobodan Milošević attempted to craft a “Greater Serbia” from the former union, but his policies instead led to the secession of Slovenia, Croatia, Bosnia and Herzegovina, and Macedonia and civil war in the early 1990s. The civil war caused the death or displacement of hundreds of thousands of people and prompted international sanctions against the country. In the late 1990s more blood was spilled when the Albanian-Muslim-dominated Serbian province of Kosovo declared independence, resulting in the intervention of the North Atlantic Treaty Organization (NATO) and the United Nations, the bombing of Belgrade, and the placement of Kosovo under UN administration from mid-1999.\r\n\r\nMilošević was later defeated in presidential elections and arrested and tried before the International Court of Justice for war crimes, but the rump Yugoslavia remained unstable, as Montenegro threatened to declare independence before negotiating an agreement that maintained the country’s unification in a loose federation. In 2003, after the ratification of the pact by the parliaments of Serbia, Montenegro, and Yugoslavia, the renamed Serbia and Montenegro replaced Yugoslavia on the European map. In 2006 this loose federation came to an end, as Montenegro and Serbia were recognized as independent nations. Meanwhile, multilateral talks to determine Kosovo’s future status failed to yield a solution acceptable to both Serbs and Kosovars. Despite Serbia’s opposition, Kosovo formally seceded in February 2008.\r\n\r\nLikening the strife and dissolution that ravaged the country during the 1990s to a children’s game, Serbian poet Vasko Popa once wrote:\r\nIf you’re not smashed to bits,\r\nIf you’re still in one piece and get up in one piece,\r\nYou can start playing.\r\nBy the early 21st century, Serbia was putting behind it the tragedy of its recent past to rebuild as a singular, independent country on a new Balkan Peninsula.","continent":"Europe","climate_zone":"CFB = Temperate oceanic climate; coldest month averaging above 0 °C (32 °F), all months with average temperatures below 22 °C (71.6 °F), and at least four months averaging above 10 °C (50 °F). No significant precipitation difference between seasons (neither abovementioned set of conditions fulfilled).","language":"Serbian","safety_index":1.92100000000000004,"safety_and_security":"","broadband_speed":61.52000000000000312,"internet_accessibility":"","cost_of_living":1886,"avg_rent_cost":823,"healthcare_index":52.10000000000000142,"cultural_and_recreational_opportunities":"","flag_url":"https://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Flag_of_Serbia.svg/100px-Flag_of_Serbia.svg.png","image":"","mobile_speed":46.78999999999999915},
{"id":54,"name":"Armenia","capital":"Yerevan","description":"Armenia, landlocked country of Transcaucasia, lying just south of the great mountain range of the Caucasus and fronting the northwestern extremity of Asia. To the north and east Armenia is bounded by Georgia and Azerbaijan, while its neighbours to the southeast and west are, respectively, Iran and Turkey. Naxçıvan, an exclave of Azerbaijan, borders Armenia to the southwest. The capital is Yerevan (Erevan).\r\n\r\nArmenia\r\nArmenia\r\nModern Armenia comprises only a small portion of ancient Armenia, one of the world’s oldest centres of civilization. At its height, Armenia extended from the south-central Black Sea coast to the Caspian Sea and from the Mediterranean Sea to Lake Urmia in present-day Iran. Ancient Armenia was subjected to constant foreign incursions, finally losing its autonomy in the 14th century CE. The centuries-long rule of Ottoman and Persian conquerors imperiled the very existence of the Armenian people. Eastern Armenia was annexed by Russia during the 19th century, while western Armenia remained under Ottoman rule, and in 1894–96 and 1915 the Ottoman government perpetrated systematic massacres and forced deportations of Armenians.\r\n\r\nThe portion of Armenia lying within the former Russian Empire declared independence on May 28, 1918, but in 1920 it was invaded by forces from Turkey and Soviet Russia. The Soviet Republic of Armenia was established on November 29, 1920; in 1922 Armenia became part of the Transcaucasian Soviet Federated Socialist Republic; and in 1936 this republic was dissolved and Armenia became a constituent (union) republic of the Soviet Union. Armenia declared sovereignty on August 23, 1990, and independence on September 23, 1991.","continent":"Asia","climate_zone":"DFB = Warm-summer humid continental climate; coldest month averaging below 0 °C (32 °F), all months with average temperatures below 22 °C (71.6 °F), and at least four months averaging above 10 °C (50 °F). No significant precipitation difference between seasons (neither abovementioned set of conditions fulfilled).","language":"Armenian","safety_index":1.929000000000000047,"safety_and_security":"","broadband_speed":40.0799999999999983,"internet_accessibility":"","cost_of_living":2273,"avg_rent_cost":1106,"healthcare_index":null,"cultural_and_recreational_opportunities":"","flag_url":"https://upload.wikimedia.org/wikipedia/commons/thumb/2/2f/Flag_of_Armenia.svg/100px-Flag_of_Armenia.svg.png","image":"country_images/Armenia_mN1GNQ6.jpg","mobile_speed":24.69000000000000127},
{"id":56,"name":"Costa Rica","capital":"San José","description":"Costa Rica, country of Central America. Its capital is San José.\r\n\r\nOf all the Central American countries, Costa Rica is generally regarded as having the most stable and most democratic government. Its constitution of 1949 provides for a unicameral legislature, a fair judicial system, and an independent electoral body. Moreover, the constitution abolished the country’s army, gave women the right to vote, and provided other social, economic, and educational guarantees for all of its citizens. Throughout the 1970s and ’80s Costa Rica managed to stay relatively peaceful compared with its war-torn neighbours. It has one of the highest literacy rates (more than nine-tenths) in the Western Hemisphere and a solid educational system from the primary grades through the university level. Several renowned universities and an active network of bookstores and publishing houses tend to make San José the nucleus of intellectual life in Central America. Because of the country’s peaceful reputation and its commitment to human rights, several nongovernmental organizations and pro-democracy foundations have their headquarters in San José. Costa Rica is also known for its strong commitment to the environment and for protecting its numerous national parks. These factors, along with an established ecotourism industry, have attracted foreign investment, which shifted the country’s once agriculture-based economy to one dominated by services and technology by the late 20th century.\r\n\r\nTicos, as the people of Costa Rica are called, use the phrase pura vida (“pure life”) in their everyday speech, as a greeting or to show appreciation for something. Ticos are generally proud of their political freedoms and their relatively stable economy.","continent":"North America","climate_zone":"CFB = Temperate oceanic climate; coldest month averaging above 0 °C (32 °F), all months with average temperatures below 22 °C (71.6 °F), and at least four months averaging above 10 °C (50 °F). No significant precipitation difference between seasons (neither abovementioned set of conditions fulfilled).","language":"Spanish","safety_index":1.731000000000000094,"safety_and_security":"","broadband_speed":64.73999999999999489,"internet_accessibility":"","cost_of_living":1914,"avg_rent_cost":828,"healthcare_index":64.59999999999999431,"cultural_and_recreational_opportunities":"","flag_url":"https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/Flag_of_Costa_Rica_%28state%29.svg/100px-Flag_of_Costa_Rica_%28state%29.svg.png","image":"country_images/Costa_Rica_NUmFXsO.jpg","mobile_speed":17.87999999999999901},
{"id":57,"name":"Mexico","capital":"Mexico City","description":"Mexico, country of southern North America and the third largest country in Latin America, after Brazil and Argentina. Mexican society is characterized by extremes of wealth and poverty, with a limited middle class wedged between an elite cadre of landowners and investors on the one hand and masses of rural and urban poor on the other. But in spite of the challenges it faces as a developing country, Mexico is one of the chief economic and political forces in Latin America. It has a dynamic industrial base, vast mineral resources, a wide-ranging service sector, and the world’s largest population of Spanish speakers—about two and a half times that of Spain or Colombia. As its official name suggests, the Estados Unidos Mexicanos (United Mexican States) incorporates 31 socially and physically diverse states and the Federal District.\r\n\r\nMore than half of the Mexican people live in the centre of the country, whereas vast areas of the arid north and the tropical south are sparsely settled. Migrants from impoverished rural areas have poured into Mexico’s cities, and nearly four-fifths of Mexicans now live in urban areas. Mexico City, the capital, is one of the most populous cities and metropolitan areas in the world. Mexico has experienced a series of economic booms leading to periods of impressive social gains, followed by busts, with significant declines in living standards for the middle and lower classes. The country remains economically fragile despite the forging of stronger ties with the United States and Canada through the North American Free Trade Agreement (NAFTA).\r\n\r\nMexico’s urban growing pains are in sharp counterpoint to the traditional lifestyles that prevail in more-isolated rural areas. In states such as Oaxaca or Chiapas, small communal villages remain where indigenous peasants live much as their ancestors did. The cultural remnants of great pre-Columbian civilizations, such as Teotihuacán or the Mayan pyramids at Chichén Itzá and Tulum, provide a contrast to colonial towns such as Taxco or Querétaro. In turn, these towns appear as historical relics when compared with the modern metropolis of Mexico City. Yet even the bustling capital city, which has been continually built and rebuilt on the rubble of past civilizations, reveals Mexico’s wide range of social, economic, and cultural struggles. As the renowned Mexican poet and intellectual Octavio Paz observed,\r\nPast epochs never vanish completely, and blood still drips from all their wounds, even the most ancient. Sometimes the most remote or hostile beliefs and feelings are found together in one city or one soul, or are superimposed like [pre-Columbian] pyramids that almost always conceal others.\r\n\r\nIt is this tremendous cultural and economic diversity, distributed over an enormously complex and varied physical environment, that gives Mexico its unique character.","continent":"North America","climate_zone":"BSK = Cold semi-arid climate","language":"Mexican","safety_index":2.599000000000000198,"safety_and_security":"","broadband_speed":49.60999999999999944,"internet_accessibility":"","cost_of_living":1825,"avg_rent_cost":841,"healthcare_index":72.5,"cultural_and_recreational_opportunities":"","flag_url":"https://upload.wikimedia.org/wikipedia/commons/thumb/f/fc/Flag_of_Mexico.svg/100px-Flag_of_Mexico.svg.png","image":"","mobile_speed":25.9200000000000017},
{"id":58,"name":"Panama","capital":"Panama City","description":"Panama, country of Central America located on the Isthmus of Panama, the narrow bridge of land that connects North and South America. Embracing the isthmus and more than 1,600 islands off its Atlantic and Pacific coasts, the tropical nation is renowned as the site of the Panama Canal, which cuts through its midsection. It is equally well known for its natural beauty, for its diverse plant and animal life, including hundreds of bird and tree species, and for its vibrant music and culture.\r\n\r\nThe home of several Native American peoples, such as the Guaymí, Kuna, and Chocó, Panama became the first Spanish colony on the Pacific. Celebrated as “the door to the seas and key to the universe,” it served in the 1530s as the staging point for the Spanish conquest of the Inca empire, and until the 19th century it was a transshipment point for gold and silver destined for Spain. With the independence of Colombia, which once controlled Panama, from Spain, Panama came to serve as another staging point, this time for oceangoing migrants to the gold fields of California.\r\n\r\nSince 1914 the 51-mile- (82-km-) long Panama Canal, which connects the Atlantic and Pacific Oceans, has afforded a long-sought shortcut for shipping and assures the country’s standing as one of the most strategic transportation hubs of the world. The canal also secures Panama’s ongoing role in international affairs and world commerce. The United States relinquished jurisdiction of the Panama Canal on December 31, 1999, marking an unprecedented shift in Panamanian society. For the first time in nearly a century as an independent nation, Panama controlled the entirety of its national territory.\r\n\r\nPanama enjoys a lively mix of cultural influences, expressed in the country’s cuisine, artwork, music, and literature. Its capital, Panama City, is located on the Pacific coast just east of the canal. A cosmopolitan city where skyscrapers tower above whitewashed bungalows, it enjoys a handsome setting and a growing importance as a commercial and financial services centre for the region. However, its economic progress has been hampered periodically by environmental problems and political turmoil.","continent":"North America","climate_zone":"AM = Tropical monsoon climate; driest month (which nearly always occurs at or soon after the “winter” solstice for that side of the equator) with precipitation less than 60 mm (2.4 in), but more than 4% the total annual precipitation.","language":"Spanish","safety_index":1.941999999999999949,"safety_and_security":"","broadband_speed":115.3799999999999955,"internet_accessibility":"","cost_of_living":2375,"avg_rent_cost":1136,"healthcare_index":60.10000000000000142,"cultural_and_recreational_opportunities":"","flag_url":"https://upload.wikimedia.org/wikipedia/commons/thumb/a/ab/Flag_of_Panama.svg/100px-Flag_of_Panama.svg.png","image":"","mobile_speed":15.93999999999999951},
{"id":59,"name":"Belize","capital":"Belmopan","description":"Belize, country located on the northeast coast of Central America. Belize, which was known as British Honduras until 1973, was the last British colony on the American mainland. Its prolonged path to independence was marked by a unique international campaign (even while it was still a British colony) against the irredentist claims of its neighbour Guatemala. Belize achieved independence on September 21, 1981, but it has retained its historical link with the United Kingdom through membership in the Commonwealth.\r\n\r\nBelize is often thought of as a Caribbean country in Central America because it has a history similar to that of English-speaking Caribbean nations. Indeed, Belize’s institutions and official language reflect its history as a British colony. However, its culture is more typical of that of other Central American countries. Belize’s small population is ethnically diverse and includes a large proportion of immigrants. Since the 1970s, migration has shifted Belize’s ethnic composition from a predominantly Creole (mixed African and British descent) population to one in which mestizos (in Belize, people of mixed Mayan and Spanish ancestry) make up half of the total inhabitants. Belize has one of the most stable and democratic political systems in Central America. After its original capital, Belize City, was ravaged by a hurricane in 1961, a new capital, Belmopan, was built inland, about 50 miles (80 km) west of Belize City, which remains the country’s commercial and cultural centre as well as its most populous city.\r\n\r\nThe name Belize is traditionally believed to have been derived from the Spanish pronunciation of the last name of Peter Wallace, a Scottish buccaneer who may have begun a settlement at the mouth of the Belize River about 1638. It is also possible that the name evolved from the Mayan word belix (“muddy water”) or belikin (“land facing the sea”).","continent":"South America","climate_zone":"AM = Tropical monsoon climate; driest month (which nearly always occurs at or soon after the “winter” solstice for that side of the equator) with precipitation less than 60 mm (2.4 in), but more than 4% the total annual precipitation.","language":"English","safety_index":null,"safety_and_security":"","broadband_speed":38.82000000000000028,"internet_accessibility":"","cost_of_living":1667,"avg_rent_cost":557,"healthcare_index":null,"cultural_and_recreational_opportunities":"","flag_url":"https://upload.wikimedia.org/wikipedia/commons/thumb/e/e7/Flag_of_Belize.svg/100px-Flag_of_Belize.svg.png","image":"country_images/Belize_yZj7QP9.jpg","mobile_speed":null},
{"id":60,"name":"El Salvador","capital":"San Salvador","description":"El Salvador, country of Central America. El Salvador is the smallest and most densely populated of the seven Central American countries. Despite having little level land, it traditionally was an agricultural country, heavily dependent upon coffee exports. By the end of the 20th century, however, the service sector had come to dominate the economy. The capital is San Salvador.\r\n\r\nFrom the late 1970s to the early 1990s, El Salvador was the focus of international attention, owing to its civil war and to external involvement in its internal conflicts. The war, which pitted a militarily and politically capable left-wing insurgency against the U.S.-backed Salvadoran Armed Forces, was caused by decades of repressive, military-dominated rule and profound social inequality. Following the United Nations-mediated 1992 peace accords, which contained fundamental provisions for El Salvador’s democratization (including the removal of the military from political affairs), the country began to recover from years of political and economic turmoil, only to be devastated by Hurricane Mitch in 1998 and by a major earthquake in 2001. Skyrocketing crime, faltering economic growth, and persistent social inequality have further hampered full postwar reconstruction.\r\n\r\nThe Pipil (descendants of the Aztecs), the predominant tribe in the region prior to the Spanish conquest, named their territory and capital Cuscatlán, meaning “Land of the Jewel”; the name is still sometimes applied to El Salvador today. The mixing of the Pipil and other tribes with European settlers is reflected in the modern-day ethnic composition of the country. El Salvadorans are known for their industriousness, and the country has produced several internationally acclaimed artists, including poet Roque Dalton.","continent":"North America","climate_zone":"AW = Tropical wet and dry or savanna climate; with the driest month having precipitation less than 60 mm (2.4 in) and less than 4% of the total annual precipitation.","language":"Spanish","safety_index":2.278999999999999915,"safety_and_security":"","broadband_speed":31.48000000000000042,"internet_accessibility":"","cost_of_living":1816,"avg_rent_cost":840,"healthcare_index":null,"cultural_and_recreational_opportunities":"","flag_url":"https://upload.wikimedia.org/wikipedia/commons/thumb/3/34/Flag_of_El_Salvador.svg/100px-Flag_of_El_Salvador.svg.png","image":"country_images/Salvador_FAkaZan.jpeg","mobile_speed":22.19000000000000127},
{"id":67,"name":"Turkey","capital":"Ankara","description":"Turkey, country that occupies a unique geographic position, lying partly in Asia and partly in Europe. Throughout its history it has acted as both a barrier and a bridge between the two continents.\r\n\r\nTurkey is situated at the crossroads of the Balkans, Caucasus, Middle East, and eastern Mediterranean. It is among the larger countries of the region in terms of territory and population, and its land area is greater than that of any European state. Nearly all of the country is in Asia, comprising the oblong peninsula of Asia Minor—also known as Anatolia (Anadolu)—and, in the east, part of a mountainous region sometimes known as the Armenian Highland. The remainder—Turkish Thrace (Trakya)—lies in the extreme southeastern part of Europe, a tiny remnant of an empire that once extended over much of the Balkans.\r\n\r\nThe country has a north-south extent that ranges from about 300 to 400 miles (480 to 640 km), and it stretches about 1,000 miles from west to east. Turkey is bounded on the north by the Black Sea, on the northeast by Georgia and Armenia, on the east by Azerbaijan and Iran, on the southeast by Iraq and Syria, on the southwest and west by the Mediterranean Sea and the Aegean Sea, and on the northwest by Greece and Bulgaria. The capital is Ankara, and its largest city and seaport is Istanbul.\r\n\r\nOf a total boundary length of some 4,000 miles (6,440 km), about three-fourths is maritime, including coastlines along the Black Sea, the Aegean, and the Mediterranean, as well as the narrows that link the Black and Aegean seas. These narrows—which include the Bosporus, the Sea of Marmara, and the Dardanelles—are known collectively as the Turkish straits; Turkey’s control of the straits, the only outlet from the Black Sea, has been a major factor in its relations with other states. Most of the islands along the Aegean coast are Greek; only the islands of Gökçeada and Bozcaada remain in Turkish hands. The maritime boundary with Greece has been a source of dispute between the two countries on numerous occasions since World War II.\r\n\r\nA long succession of political entities existed in Asia Minor over the centuries. Turkmen tribes invaded Anatolia in the 11th century CE, founding the Seljuq empire; during the 14th century the Ottoman Empire began a long expansion, reaching its peak during the 17th century. The modern Turkish republic, founded in 1923 after the collapse of the Ottoman Empire, is a nationalist, secular, parliamentary democracy. After a period of one-party rule under its founder, Mustafa Kemal (Atatürk), and his successor, Turkish governments since the 1950s have been produced by multiparty elections based on universal adult suffrage.","continent":"Asia","climate_zone":"CSB = Warm-summer Mediterranean climate; coldest month averaging above 0 °C (32 °F), all months with average temperatures below 22 °C (71.6 °F), and at least four months averaging above 10 °C (50 °F). At least three times as much precipitation in the wettest month of winter as in the driest month of summer, and driest month of summer receives less than 30 mm (1.2 in).","language":"Turkish","safety_index":2.799999999999999823,"safety_and_security":"","broadband_speed":31.69999999999999929,"internet_accessibility":"","cost_of_living":1600,"avg_rent_cost":745,"healthcare_index":70.70000000000000284,"cultural_and_recreational_opportunities":"","flag_url":"https://upload.wikimedia.org/wikipedia/commons/thumb/b/b4/Flag_of_Turkey.svg/100px-Flag_of_Turkey.svg.png","image":"","mobile_speed":31.26000000000000156},
{"id":69,"name":"Barbados","capital":"Bridgetown","description":"Barbados, island country in the southeastern Caribbean Sea, situated about 100 miles (160 km) east of Saint Vincent and the Grenadines. Roughly triangular in shape, the island measures some 20 miles (32 km) from northwest to southeast and about 15 miles (25 km) from east to west at its widest point. The capital and largest town is Bridgetown, which is also the main seaport.\r\n\r\nBarbados\r\nBarbados\r\nThe geographic position of Barbados has profoundly influenced the island’s history and culture and aspects of its economic life. Barbados is not part of the nearby archipelago of the Lesser Antilles, although it is usually grouped with it. The island is of different geologic formation; it is less mountainous and has less variety in plant and animal life. As the first Caribbean landfall from Europe and Africa, Barbados has functioned since the late 17th century as a major link between western Europe (mainly Great Britain), eastern Caribbean territories, and parts of the South American mainland. The island was a British possession without interruption from the 17th century to 1966, when it attained independence. Because of its long association with Britain, the culture of Barbados is probably more British than is that of any other Caribbean island, though elements of the African culture of the majority population have been prominent. Since independence, cultural nationalism has been fostered as part of the process of nation-building.","continent":"North America","climate_zone":"AM = Tropical monsoon climate; driest month (which nearly always occurs at or soon after the “winter” solstice for that side of the equator) with precipitation less than 60 mm (2.4 in), but more than 4% the total annual precipitation.","language":"English","safety_index":null,"safety_and_security":"","broadband_speed":78.48999999999999489,"internet_accessibility":"","cost_of_living":3843,"avg_rent_cost":1785,"healthcare_index":null,"cultural_and_recreational_opportunities":"","flag_url":"https://upload.wikimedia.org/wikipedia/commons/thumb/e/ef/Flag_of_Barbados.svg/100px-Flag_of_Barbados.svg.png","image":"country_images/Barbados_HJX6Ygz.jpg","mobile_speed":null},
{"id":70,"name":"Dominica","capital":"Roseau","description":"Dominica, island country of the Lesser Antilles in the eastern Caribbean Sea. It lies between the French islands of Guadeloupe and Marie-Galante to the north and Martinique to the south. The country has been a member of the Commonwealth since independence in 1978.\r\n\r\nThe island is 29 miles (47 km) long and has a maximum breadth of 16 miles (26 km). The capital and chief port is Roseau. Dominica’s great natural beauty, especially its spectacular mountainous topography, has impressed generations of nature lovers.","continent":"North America","climate_zone":"AF = Tropical rainforest climate; average precipitation of at least 60 mm (2.4 in) in every month.","language":"English","safety_index":null,"safety_and_security":"","broadband_speed":86.46999999999999887,"internet_accessibility":"","cost_of_living":null,"avg_rent_cost":null,"healthcare_index":null,"cultural_and_recreational_opportunities":"","flag_url":"https://upload.wikimedia.org/wikipedia/commons/thumb/c/c4/Flag_of_Dominica.svg/100px-Flag_of_Dominica.svg.png","image":"country_images/Dominica_771POf7.webp","mobile_speed":null},
{"id":71,"name":"Antigua and Barbuda","capital":"St. John's","description":"Antigua’s coastline is intricate, with bays and headlands fringed with reefs and shoals; several inlets, including Parham and English Harbour, afford anchorage for shipping, and St. John’s has a deepwater harbour. The island has an area of 108 square miles (280 square km). It is mostly low and undulating, but in the west there are volcanic rocks that rise to 1,330 feet (405 metres) at Mount Obama (formerly Boggy Peak). An absence of mountains and forests distinguishes Antigua from the other Leeward Islands. Because there are no rivers and few springs, droughts occur despite a mean annual rainfall of some 40 inches (1,000 mm). The average January temperature is around 77 °F (25 °C); that of August, 82 °F (28 °C). Summer highs can reach 90 °F (32 °C).\r\n\r\nBarbuda, formerly Dulcina, lies 25 miles (40 km) north of Antigua. A coral island, flat and well-wooded, with highlands rising to 143 feet (44 metres) at Lindsay Hill in the northeast, it is 62 square miles (161 square km) in area. Barbuda is without streams or lakes and receives less rainfall than Antigua. Codrington, the only settlement, lies on a lagoon to the west. The climate is similar to that of Antigua.\r\n\r\nRedonda, an uninhabited rock, lies 25 miles (40 km) southwest of Antigua. It rises sheer to a height of 1,000 feet (305 metres) and is 0.5 square mile (1.25 square km) in area. Phosphate deposits are located there.","continent":"South America","climate_zone":"AF = Tropical rainforest climate; average precipitation of at least 60 mm (2.4 in) in every month.","language":"English","safety_index":null,"safety_and_security":"","broadband_speed":27.30000000000000071,"internet_accessibility":"","cost_of_living":null,"avg_rent_cost":null,"healthcare_index":null,"cultural_and_recreational_opportunities":"","flag_url":"https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Flag_of_Antigua_and_Barbuda.svg/100px-Flag_of_Antigua_and_Barbuda.svg.png","image":"country_images/Antigua_and_Barbuda_EFfWDMi.jpg","mobile_speed":null},
{"id":72,"name":"Saint Lucia","capital":"Castries","description":"Saint Lucia, island state in the Caribbean Sea. It is the second largest of the Windward group in the Lesser Antilles and is located about 24 miles (39 km) south of Martinique and some 21 miles (34 km) northeast of Saint Vincent.\r\n\r\nSaint Lucia is 27 miles (43 km) long and has a maximum width of 14 miles (23 km). The capital and major port is Castries. Saint Lucia is a member of the Commonwealth.","continent":"North America","climate_zone":"AF = Tropical rainforest climate; average precipitation of at least 60 mm (2.4 in) in every month.","language":"English","safety_index":null,"safety_and_security":"","broadband_speed":74.81999999999999317,"internet_accessibility":"","cost_of_living":null,"avg_rent_cost":null,"healthcare_index":null,"cultural_and_recreational_opportunities":"","flag_url":"https://upload.wikimedia.org/wikipedia/commons/thumb/9/9f/Flag_of_Saint_Lucia.svg/100px-Flag_of_Saint_Lucia.svg.png","image":"","mobile_speed":null},
{"id":73,"name":"Grenada","capital":"St. George's","description":"Grenada, island country of the West Indies. It is the southernmost island of the north-south arc of the Lesser Antilles, lying in the eastern Caribbean Sea about 100 miles (160 km) north of the coast of Venezuela. Oval in shape, the island is approximately 21 miles (34 km) long and 12 miles (19 km) wide. The southern Grenadines—the largest of which is Carriacou, about 20 miles (32 km) north-northeast, with an area of 13 square miles (34 square km)—are a dependency.\r\n\r\nThe capital, St. George’s, on the southwest coast, is also the main port, having a fine natural harbour, and its picturesque pastel-coloured houses rise up the hillsides from the waterfront. The waterfront itself is known as the Carenage because island schooners were once careened (beached for cleaning or repair) there. St. George’s is the yachting and charter-boat centre of the eastern Caribbean.\r\n\r\nIn 1974 Grenada attained independence within the Commonwealth and membership in the United Nations. It was the first of the six West Indies Associated States to do so.","continent":"North America","climate_zone":"AW = Tropical wet and dry or savanna climate; with the driest month having precipitation less than 60 mm (2.4 in) and less than 4% of the total annual precipitation.","language":"English","safety_index":null,"safety_and_security":"","broadband_speed":64.03000000000000113,"internet_accessibility":"","cost_of_living":2623,"avg_rent_cost":1013,"healthcare_index":null,"cultural_and_recreational_opportunities":"","flag_url":"https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/Flag_of_Grenada.svg/100px-Flag_of_Grenada.svg.png","image":"","mobile_speed":null},
{"id":78,"name":"Egypt","capital":"Cairo","description":"Egypt, country located in the northeastern corner of Africa. Egypt’s heartland, the Nile River valley and delta, was the home of one of the principal civilizations of the ancient Middle East and, like Mesopotamia farther east, was the site of one of the world’s earliest urban and literate societies. Pharaonic Egypt thrived for some 3,000 years through a series of native dynasties that were interspersed with brief periods of foreign rule. After Alexander the Great conquered the region in 323 BCE, urban Egypt became an integral part of the Hellenistic world. Under the Greek Ptolemaic dynasty, an advanced literate society thrived in the city of Alexandria, but what is now Egypt was conquered by the Romans in 30 BCE. It remained part of the Roman Republic and Empire and then part of Rome’s successor state, the Byzantine Empire, until its conquest by Arab Muslim armies in 639–642 CE.\r\n\r\nUntil the Muslim conquest, great continuity had typified Egyptian rural life. Despite the incongruent ethnicity of successive ruling groups and the cosmopolitan nature of Egypt’s larger urban centres, the language and culture of the rural, agrarian masses—whose lives were largely measured by the annual rise and fall of the Nile River, with its annual inundation—had changed only marginally throughout the centuries. Following the conquests, both urban and rural culture began to adopt elements of Arab culture, and an Arabic vernacular eventually replaced the Egyptian language as the common means of spoken discourse. Moreover, since that time, Egypt’s history has been part of the broader Islamic world, and though Egyptians continued to be ruled by foreign elite—whether Arab, Kurdish, Circassian, or Turkish—the country’s cultural milieu remained predominantly Arab.\r\n\r\nEgypt eventually became one of the intellectual and cultural centres of the Arab and Islamic world, a status that was fortified in the mid-13th century when Mongol armies sacked Baghdad and ended the Abbasid caliphate. The Mamluk sultans of Egypt, under whom the country thrived for several centuries, established a pseudo-caliphate of dubious legitimacy. But in 1517 the Ottoman Empire defeated the Mamluks and established control over Egypt that lasted until 1798, when Napoleon I led a French army in a short occupation of the country.","continent":"Africa","climate_zone":"BWH = Hot desert climate","language":"Egyptian","safety_index":2.266999999999999905,"safety_and_security":"","broadband_speed":47.60999999999999944,"internet_accessibility":"","cost_of_living":925,"avg_rent_cost":365,"healthcare_index":47.5,"cultural_and_recreational_opportunities":"","flag_url":"https://upload.wikimedia.org/wikipedia/commons/thumb/f/fe/Flag_of_Egypt.svg/100px-Flag_of_Egypt.svg.png","image":"country_images/Egypt_uEg6Q8C.jpg","mobile_speed":22.28999999999999915}]
